[Killed] BlockStatement
src/services/userService.ts:8:83
 // Single Responsibility: user business logic only
 // Dependency Inversion: routes depend on this abstraction, not on prisma directly
 
-export async function registerUser(email: string, password: string, name: string) {
-  const hashed = await bcrypt.hash(password, 10)
-  const user = await prisma.user.create({ data: { email, password: hashed, name } })
-  const { password: _, ...safeUser } = user
-  return safeUser
-}
+export async function registerUser(email: string, password: string, name: string) {}
 
 export async function loginUser(email: string, password: string): Promise<{ token: string }> {
killedBy: POST /users/register creates a user and returns user data
statusReason: expected '' to match object { email: 'alice@example.com', …(1) }

[Killed] ObjectLiteral
src/services/userService.ts:10:49
 
 export async function registerUser(email: string, password: string, name: string) {
   const hashed = await bcrypt.hash(password, 10)
-  const user = await prisma.user.create({ data: { email, password: hashed, name } })
+  const user = await prisma.user.create({ data: {} })
   const { password: _, ...safeUser } = user
   return safeUser
killedBy: POST /users/register creates a user and returns user data
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/services/userService.ts:10:41
 
 export async function registerUser(email: string, password: string, name: string) {
   const hashed = await bcrypt.hash(password, 10)
-  const user = await prisma.user.create({ data: { email, password: hashed, name } })
+  const user = await prisma.user.create({})
   const { password: _, ...safeUser } = user
   return safeUser
killedBy: POST /users/register creates a user and returns user data
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/services/userService.ts:15:94
   return safeUser
 }
 
-export async function loginUser(email: string, password: string): Promise<{ token: string }> {
-  const user = await prisma.user.findUnique({ where: { email } })
-  if (!user) throw new Error('Invalid credentials')
-
-  const valid = await bcrypt.compare(password, user.password)
-  if (!valid) throw new Error('Invalid credentials')
-
-  const secret = process.env.JWT_SECRET
-  if (!secret) throw new Error('Server misconfiguration')
-
-  const token = jwt.sign({ userId: user.id }, secret, { expiresIn: '7d' })
-  return { token }
-}
+export async function loginUser(email: string, password: string): Promise<{ token: string }> {}
 
 export async function getUserById(id: number) {
killedBy: POST /users/login returns a token for valid credentials
statusReason: expected '' to have property "token"

[Killed] ObjectLiteral
src/services/userService.ts:16:54
 }
 
 export async function loginUser(email: string, password: string): Promise<{ token: string }> {
-  const user = await prisma.user.findUnique({ where: { email } })
+  const user = await prisma.user.findUnique({ where: {} })
   if (!user) throw new Error('Invalid credentials')
 
killedBy: POST /users/login returns a token for valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/services/userService.ts:17:7
 
 export async function loginUser(email: string, password: string): Promise<{ token: string }> {
   const user = await prisma.user.findUnique({ where: { email } })
-  if (!user) throw new Error('Invalid credentials')
+  if (true) throw new Error('Invalid credentials')
 
   const valid = await bcrypt.compare(password, user.password)
killedBy: POST /users/login returns a token for valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/services/userService.ts:17:7
 
 export async function loginUser(email: string, password: string): Promise<{ token: string }> {
   const user = await prisma.user.findUnique({ where: { email } })
-  if (!user) throw new Error('Invalid credentials')
+  if (user) throw new Error('Invalid credentials')
 
   const valid = await bcrypt.compare(password, user.password)
killedBy: POST /users/login returns a token for valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/services/userService.ts:20:7
   if (!user) throw new Error('Invalid credentials')
 
   const valid = await bcrypt.compare(password, user.password)
-  if (!valid) throw new Error('Invalid credentials')
+  if (false) throw new Error('Invalid credentials')
 
   const secret = process.env.JWT_SECRET
killedBy: POST /users/login returns 401 for wrong password
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/services/userService.ts:20:7
   if (!user) throw new Error('Invalid credentials')
 
   const valid = await bcrypt.compare(password, user.password)
-  if (!valid) throw new Error('Invalid credentials')
+  if (true) throw new Error('Invalid credentials')
 
   const secret = process.env.JWT_SECRET
killedBy: POST /users/login returns a token for valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/services/userService.ts:23:7
   if (!valid) throw new Error('Invalid credentials')
 
   const secret = process.env.JWT_SECRET
-  if (!secret) throw new Error('Server misconfiguration')
+  if (true) throw new Error('Server misconfiguration')
 
   const token = jwt.sign({ userId: user.id }, secret, { expiresIn: '7d' })
killedBy: POST /users/login returns a token for valid credentials
statusReason: Invalid `prisma.user.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:13:22

  10 const name = overrides?.name ?? 'Test User'
  11 const password = overrides?.password ?? 'password123'
  12 const hashed = await bcrypt.hash(password, 10)
→ 13 return prisma.user.create(
Unique constraint failed on the fields: (`email`)

[Killed] BooleanLiteral
src/services/userService.ts:23:7
   if (!valid) throw new Error('Invalid credentials')
 
   const secret = process.env.JWT_SECRET
-  if (!secret) throw new Error('Server misconfiguration')
+  if (secret) throw new Error('Server misconfiguration')
 
   const token = jwt.sign({ userId: user.id }, secret, { expiresIn: '7d' })
killedBy: POST /users/login returns a token for valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/services/userService.ts:25:55
   const secret = process.env.JWT_SECRET
   if (!secret) throw new Error('Server misconfiguration')
 
-  const token = jwt.sign({ userId: user.id }, secret, { expiresIn: '7d' })
+  const token = jwt.sign({ userId: user.id }, secret, {})
   return { token }
 }
killedBy: POST /users/login returns a token for valid credentials
statusReason: Invalid `prisma.user.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:13:22

  10 const name = overrides?.name ?? 'Test User'
  11 const password = overrides?.password ?? 'password123'
  12 const hashed = await bcrypt.hash(password, 10)
→ 13 return prisma.user.create(
Unique constraint failed on the fields: (`email`)

[Killed] BlockStatement
src/services/userService.ts:29:47
   return { token }
 }
 
-export async function getUserById(id: number) {
-  const user = await prisma.user.findUnique({ where: { id } })
-  if (!user) return null
-  const { password: _, ...safeUser } = user
-  return safeUser
-}
+export async function getUserById(id: number) {}
 
killedBy: GET /users/:id returns the user
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/services/userService.ts:31:7
 
 export async function getUserById(id: number) {
   const user = await prisma.user.findUnique({ where: { id } })
-  if (!user) return null
+  if (true) return null
   const { password: _, ...safeUser } = user
   return safeUser
killedBy: GET /users/:id returns the user
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/services/userService.ts:31:7
 
 export async function getUserById(id: number) {
   const user = await prisma.user.findUnique({ where: { id } })
-  if (!user) return null
+  if (user) return null
   const { password: _, ...safeUser } = user
   return safeUser
killedBy: GET /users/:id returns the user
statusReason: Invalid `prisma.user.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:13:22

  10 const name = overrides?.name ?? 'Test User'
  11 const password = overrides?.password ?? 'password123'
  12 const hashed = await bcrypt.hash(password, 10)
→ 13 return prisma.user.create(
Unique constraint failed on the fields: (`email`)
