[Timeout] BlockStatement
src/middleware/auth.ts:10:85
 }
 
 // Single Responsibility: this module only handles JWT verification
-export function authenticate(req: Request, res: Response, next: NextFunction): void {
-  const header = req.headers.authorization
-  if (!header) {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const token = header.replace('Bearer ', '')
-  const secret = process.env.JWT_SECRET
-  if (!secret) {
-    res.status(500).json({ error: 'Server misconfiguration' })
-    return
-  }
-
-  try {
-    const payload = jwt.verify(token, secret) as { userId: number }
-    ;(req as AuthRequest).userId = payload.userId
-    next()
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-  }
-}
+export function authenticate(req: Request, res: Response, next: NextFunction): void {}
 

[Killed] BooleanLiteral
src/middleware/auth.ts:12:7
 // Single Responsibility: this module only handles JWT verification
 export function authenticate(req: Request, res: Response, next: NextFunction): void {
   const header = req.headers.authorization
-  if (!header) {
+  if (header) {
     res.status(401).json({ error: 'Unauthorized' })
     return
killedBy: POST /cards returns 401 without auth
statusReason: expected 500 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/middleware/auth.ts:12:7
 // Single Responsibility: this module only handles JWT verification
 export function authenticate(req: Request, res: Response, next: NextFunction): void {
   const header = req.headers.authorization
-  if (!header) {
+  if (true) {
     res.status(401).json({ error: 'Unauthorized' })
     return
killedBy: POST /cards creates a card and returns 201
statusReason: Invalid `prisma.user.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:13:22

  10 const name = overrides?.name ?? 'Test User'
  11 const password = overrides?.password ?? 'password123'
  12 const hashed = await bcrypt.hash(password, 10)
→ 13 return prisma.user.create(
Unique constraint failed on the fields: (`email`)

[Killed] StringLiteral
src/middleware/auth.ts:17:32
     return
   }
 
-  const token = header.replace('Bearer ', '')
+  const token = header.replace("", '')
   const secret = process.env.JWT_SECRET
   if (!secret) {
killedBy: POST /cards creates a card and returns 201
statusReason: expected 401 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/middleware/auth.ts:19:7
 
   const token = header.replace('Bearer ', '')
   const secret = process.env.JWT_SECRET
-  if (!secret) {
+  if (true) {
     res.status(500).json({ error: 'Server misconfiguration' })
     return
killedBy: POST /cards creates a card and returns 201
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BooleanLiteral
src/middleware/auth.ts:19:7
 
   const token = header.replace('Bearer ', '')
   const secret = process.env.JWT_SECRET
-  if (!secret) {
+  if (secret) {
     res.status(500).json({ error: 'Server misconfiguration' })
     return
killedBy: POST /cards creates a card and returns 201
statusReason: expected 500 to be 201 // Object.is equality

[Timeout] BlockStatement
src/middleware/auth.ts:24:7
     return
   }
 
-  try {
-    const payload = jwt.verify(token, secret) as { userId: number }
-    ;(req as AuthRequest).userId = payload.userId
-    next()
-  } catch {
+  try {} catch {
     res.status(401).json({ error: 'Unauthorized' })
   }

[NoCoverage] BlockStatement
src/middleware/auth.ts:28:11
     const payload = jwt.verify(token, secret) as { userId: number }
     ;(req as AuthRequest).userId = payload.userId
     next()
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-  }
+  } catch {}
 }
 
