[Timeout] BlockStatement
src/services/boardService.ts:6:56
 // Single Responsibility: board business logic only
 // Fixes N+1 queries using Prisma include (Open/Closed: easy to extend with new includes)
 
-export async function getBoardsForUser(userId: number) {
-  const memberships = await prisma.boardMember.findMany({
-    where: { userId },
-    include: { board: true },
-  })
-  return memberships.map((m) => m.board)
-}
+export async function getBoardsForUser(userId: number) {}
 
 export async function getBoardDetail(boardId: number) {

[Timeout] ObjectLiteral
src/services/boardService.ts:7:57
 // Fixes N+1 queries using Prisma include (Open/Closed: easy to extend with new includes)
 
 export async function getBoardsForUser(userId: number) {
-  const memberships = await prisma.boardMember.findMany({
-    where: { userId },
-    include: { board: true },
-  })
+  const memberships = await prisma.boardMember.findMany({})
   return memberships.map((m) => m.board)
 }

[Killed] BooleanLiteral
src/services/boardService.ts:9:23
 export async function getBoardsForUser(userId: number) {
   const memberships = await prisma.boardMember.findMany({
     where: { userId },
-    include: { board: true },
+    include: { board: false },
   })
   return memberships.map((m) => m.board)
killedBy: GET /boards returns boards for the authenticated user
statusReason: expected null to match object { name: 'My Board' }

[Killed] ArrowFunction
src/services/boardService.ts:11:26
     where: { userId },
     include: { board: true },
   })
-  return memberships.map((m) => m.board)
+  return memberships.map(() => undefined)
 }
 
killedBy: GET /boards returns boards for the authenticated user
statusReason: Invalid `prisma.user.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:13:22

  10 const name = overrides?.name ?? 'Test User'
  11 const password = overrides?.password ?? 'password123'
  12 const hashed = await bcrypt.hash(password, 10)
→ 13 return prisma.user.create(
Unique constraint failed on the fields: (`email`)

[Killed] BlockStatement
src/services/boardService.ts:14:55
   return memberships.map((m) => m.board)
 }
 
-export async function getBoardDetail(boardId: number) {
-  return prisma.board.findUnique({
-    where: { id: boardId },
-    include: {
-      lists: {
-        orderBy: { position: 'asc' },
-        include: {
-          cards: {
-            orderBy: { position: 'asc' },
-            include: {
-              comments: true,
-              labels: { include: { label: true } },
-            },
-          },
-        },
-      },
-    },
-  })
-}
+export async function getBoardDetail(boardId: number) {}
 
 export async function isBoardMember(userId: number, boardId: number): Promise<boolean> {
killedBy: GET /boards/:id returns board with lists and cards
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/services/boardService.ts:17:14
 export async function getBoardDetail(boardId: number) {
   return prisma.board.findUnique({
     where: { id: boardId },
-    include: {
-      lists: {
-        orderBy: { position: 'asc' },
-        include: {
-          cards: {
-            orderBy: { position: 'asc' },
-            include: {
-              comments: true,
-              labels: { include: { label: true } },
-            },
-          },
-        },
-      },
-    },
+    include: {},
   })
 }
killedBy: GET /boards/:id returns board with lists and cards
statusReason: Target cannot be null or undefined.

[Killed] ObjectLiteral
src/services/boardService.ts:18:14
   return prisma.board.findUnique({
     where: { id: boardId },
     include: {
-      lists: {
-        orderBy: { position: 'asc' },
-        include: {
-          cards: {
-            orderBy: { position: 'asc' },
-            include: {
-              comments: true,
-              labels: { include: { label: true } },
-            },
-          },
-        },
-      },
+      lists: {},
     },
   })
killedBy: GET /boards/:id returns board with lists and cards
statusReason: Target cannot be null or undefined.

[Survived] BooleanLiteral
src/services/boardService.ts:24:25
           cards: {
             orderBy: { position: 'asc' },
             include: {
-              comments: true,
+              comments: false,
               labels: { include: { label: true } },
             },

[Killed] BooleanLiteral
src/services/boardService.ts:25:43
             orderBy: { position: 'asc' },
             include: {
               comments: true,
-              labels: { include: { label: true } },
+              labels: { include: { label: false } },
             },
           },
killedBy: GET /boards/:id returns board with lists and cards
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/services/boardService.ts:34:88
   })
 }
 
-export async function isBoardMember(userId: number, boardId: number): Promise<boolean> {
-  const membership = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
-  })
-  return membership !== null
-}
+export async function isBoardMember(userId: number, boardId: number): Promise<boolean> {}
 
 export async function createBoard(userId: number, name: string) {
killedBy: GET /boards/:id returns board with lists and cards
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/services/boardService.ts:36:30
 
 export async function isBoardMember(userId: number, boardId: number): Promise<boolean> {
   const membership = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
+    where: { userId_boardId: {} },
   })
   return membership !== null
killedBy: GET /boards/:id returns 403 if user is not a member
statusReason: Invalid `prisma.user.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:13:22

  10 const name = overrides?.name ?? 'Test User'
  11 const password = overrides?.password ?? 'password123'
  12 const hashed = await bcrypt.hash(password, 10)
→ 13 return prisma.user.create(
Unique constraint failed on the fields: (`email`)

[Killed] ObjectLiteral
src/services/boardService.ts:36:12
 
 export async function isBoardMember(userId: number, boardId: number): Promise<boolean> {
   const membership = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
+    where: {},
   })
   return membership !== null
killedBy: GET /boards/:id returns 403 if user is not a member
statusReason: Invalid `prisma.user.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:13:22

  10 const name = overrides?.name ?? 'Test User'
  11 const password = overrides?.password ?? 'password123'
  12 const hashed = await bcrypt.hash(password, 10)
→ 13 return prisma.user.create(
Unique constraint failed on the fields: (`email`)

[Killed] ConditionalExpression
src/services/boardService.ts:38:10
   const membership = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId } },
   })
-  return membership !== null
+  return false
 }
 
killedBy: GET /boards/:id returns board with lists and cards
statusReason: expected 403 to be 200 // Object.is equality

[Killed] EqualityOperator
src/services/boardService.ts:38:10
   const membership = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId } },
   })
-  return membership !== null
+  return membership === null
 }
 
killedBy: GET /boards/:id returns 403 if user is not a member
statusReason: expected 404 to be 403 // Object.is equality

[Killed] BlockStatement
src/services/boardService.ts:41:65
   return membership !== null
 }
 
-export async function createBoard(userId: number, name: string) {
-  const board = await prisma.board.create({ data: { name } })
-  await prisma.boardMember.create({ data: { userId, boardId: board.id, role: 'owner' } })
-  return board
-}
+export async function createBoard(userId: number, name: string) {}
 
 export async function addBoardMember(boardId: number, memberId: number) {
killedBy: POST /boards creates a board and returns 201
statusReason: expected '' to match object { name: 'New Board' }

[Timeout] ObjectLiteral
src/services/boardService.ts:42:51
 }
 
 export async function createBoard(userId: number, name: string) {
-  const board = await prisma.board.create({ data: { name } })
+  const board = await prisma.board.create({ data: {} })
   await prisma.boardMember.create({ data: { userId, boardId: board.id, role: 'owner' } })
   return board

[Killed] ObjectLiteral
src/services/boardService.ts:43:43
 
 export async function createBoard(userId: number, name: string) {
   const board = await prisma.board.create({ data: { name } })
-  await prisma.boardMember.create({ data: { userId, boardId: board.id, role: 'owner' } })
+  await prisma.boardMember.create({ data: {} })
   return board
 }
killedBy: POST /boards creates a board and returns 201
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/services/boardService.ts:47:73
   return board
 }
 
-export async function addBoardMember(boardId: number, memberId: number) {
-  return prisma.boardMember.create({ data: { userId: memberId, boardId, role: 'member' } })
-}
+export async function addBoardMember(boardId: number, memberId: number) {}
 
killedBy: POST /boards/:id/members adds a member to the board
statusReason: Invalid `prisma.boardMember.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:23:28

  20 
  21 export async function createBoard(userId: number, name = 'Test Board') {
  22   const board = await prisma.board.create({ data: { name } })
→ 23   await prisma.boardMember.create(
Foreign key constraint violated: `foreign key`

[Survived] StringLiteral
src/services/boardService.ts:48:79
 }
 
 export async function addBoardMember(boardId: number, memberId: number) {
-  return prisma.boardMember.create({ data: { userId: memberId, boardId, role: 'member' } })
+  return prisma.boardMember.create({ data: { userId: memberId, boardId, role: "" } })
 }
 
