[Killed] ConditionalExpression
src/middleware/auth.ts:4:20
 import { Request } from 'express'
 import * as jwt from 'jsonwebtoken'
 
-const JWT_SECRET = process.env.JWT_SECRET || 'super-secret-key-change-me'
+const JWT_SECRET = false
 
 export function verifyToken(req: Request): number {
killedBy: auth middleware signToken returns a JWT
statusReason: secretOrPrivateKey must have a value

[Killed] ConditionalExpression
src/middleware/auth.ts:4:20
 import { Request } from 'express'
 import * as jwt from 'jsonwebtoken'
 
-const JWT_SECRET = process.env.JWT_SECRET || 'super-secret-key-change-me'
+const JWT_SECRET = true
 
 export function verifyToken(req: Request): number {
killedBy: auth middleware signToken returns a JWT
statusReason: secretOrPrivateKey is not valid key material

[Killed] BlockStatement
src/middleware/auth.ts:6:51
 
 const JWT_SECRET = process.env.JWT_SECRET || 'super-secret-key-change-me'
 
-export function verifyToken(req: Request): number {
-  const header = req.headers.authorization
-  if (!header) throw new Error('No auth header')
-  const token = header.replace('Bearer ', '')
-  const payload = jwt.verify(token, JWT_SECRET) as { userId: number }
-  return payload.userId
-}
+export function verifyToken(req: Request): number {}
 
 export function signToken(userId: number): string {
killedBy: auth middleware verifyToken throws if no header
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/middleware/auth.ts:8:7
 
 export function verifyToken(req: Request): number {
   const header = req.headers.authorization
-  if (!header) throw new Error('No auth header')
+  if (header) throw new Error('No auth header')
   const token = header.replace('Bearer ', '')
   const payload = jwt.verify(token, JWT_SECRET) as { userId: number }
killedBy: auth middleware verifyToken throws if no header
statusReason: expected [Function] to throw error including 'No auth header' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/middleware/auth.ts:8:7
 
 export function verifyToken(req: Request): number {
   const header = req.headers.authorization
-  if (!header) throw new Error('No auth header')
+  if (false) throw new Error('No auth header')
   const token = header.replace('Bearer ', '')
   const payload = jwt.verify(token, JWT_SECRET) as { userId: number }
killedBy: auth middleware verifyToken throws if no header
statusReason: expected [Function] to throw error including 'No auth header' but got 'Cannot read properties of undefined (…'

[NoCoverage] StringLiteral
src/middleware/auth.ts:9:32
 export function verifyToken(req: Request): number {
   const header = req.headers.authorization
   if (!header) throw new Error('No auth header')
-  const token = header.replace('Bearer ', '')
+  const token = header.replace("", '')
   const payload = jwt.verify(token, JWT_SECRET) as { userId: number }
   return payload.userId

[Killed] BlockStatement
src/middleware/auth.ts:14:51
   return payload.userId
 }
 
-export function signToken(userId: number): string {
-  return jwt.sign({ userId }, JWT_SECRET, { expiresIn: '7d' })
-}
+export function signToken(userId: number): string {}
 
killedBy: auth middleware signToken returns a JWT
statusReason: expected 'undefined' to be 'string' // Object.is equality
