[Killed] LogicalOperator
src/lib/auth.ts:4:27
 import * as jwt from 'jsonwebtoken'
 import { Request } from 'express'
 
-export const JWT_SECRET = process.env.JWT_SECRET ?? 'super-secret-key-change-me'
+export const JWT_SECRET = process.env.JWT_SECRET && 'super-secret-key-change-me'
 
 export function verifyToken(req: Request): number {
killedBy: GET /cards/:id returns 404 when the card does not exist
statusReason: secretOrPrivateKey must have a value

[Killed] ConditionalExpression
src/lib/auth.ts:8:7
 
 export function verifyToken(req: Request): number {
   const header = req.headers.authorization
-  if (!header) throw new Error('No auth header')
+  if (true) throw new Error('No auth header')
   const token = header.replace('Bearer ', '')
   const payload = jwt.verify(token, JWT_SECRET) as { userId: number }
killedBy: GET /cards/:id returns 404 when the card does not exist
statusReason: expected 401 to be 404 // Object.is equality
