[Killed] BlockStatement
src/services/cardService.ts:5:47
 
 // Single Responsibility: card business logic only
 
-export async function getCardById(id: number) {
-  return prisma.card.findUnique({
-    where: { id },
-    include: {
-      comments: true,
-      labels: { include: { label: true } },
-    },
-  })
-}
+export async function getCardById(id: number) {}
 
 export async function createCard(
killedBy: GET /cards/:id returns card with comments and labels
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/services/cardService.ts:10:26
     where: { id },
     include: {
       comments: true,
-      labels: { include: { label: true } },
+      labels: { include: {} },
     },
   })
killedBy: PATCH /cards/:id/move moves a card to a different list
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/services/cardService.ts:20:3
   listId: number,
   description?: string,
   assigneeId?: number,
-) {
-  const count = await prisma.card.count({ where: { listId } })
-  return prisma.card.create({
-    data: { title, description, listId, assigneeId, position: count },
-  })
-}
+) {}
 
 export async function moveCard(cardId: number, targetListId: number, position: number) {
killedBy: POST /cards creates a card and returns 201
statusReason: expected '' to match object { title: 'New Task', listId: 65 }

[Survived] BlockStatement
src/services/cardService.ts:27:88
   })
 }
 
-export async function moveCard(cardId: number, targetListId: number, position: number) {
-  return prisma.$transaction([
-    prisma.card.update({ where: { id: cardId }, data: { listId: targetListId, position } }),
-  ]).then(([card]) => card)
-}
+export async function moveCard(cardId: number, targetListId: number, position: number) {}
 
 export async function addComment(cardId: number, userId: number, content: string) {

[Survived] ArrowFunction
src/services/cardService.ts:30:11
 export async function moveCard(cardId: number, targetListId: number, position: number) {
   return prisma.$transaction([
     prisma.card.update({ where: { id: cardId }, data: { listId: targetListId, position } }),
-  ]).then(([card]) => card)
+  ]).then(() => undefined)
 }
 

[Killed] BlockStatement
src/services/cardService.ts:33:83
   ]).then(([card]) => card)
 }
 
-export async function addComment(cardId: number, userId: number, content: string) {
-  return prisma.comment.create({ data: { content, cardId, userId } })
-}
+export async function addComment(cardId: number, userId: number, content: string) {}
 
 export async function deleteCard(cardId: number) {
killedBy: POST /cards/:id/comments adds a comment to the card and returns 201
statusReason: Invalid `prisma.user.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:13:22

  10 const name = overrides?.name ?? 'Test User'
  11 const password = overrides?.password ?? 'password123'
  12 const hashed = await bcrypt.hash(password, 10)
→ 13 return prisma.user.create(
Unique constraint failed on the fields: (`email`)

[Killed] ObjectLiteral
src/services/cardService.ts:34:32
 }
 
 export async function addComment(cardId: number, userId: number, content: string) {
-  return prisma.comment.create({ data: { content, cardId, userId } })
+  return prisma.comment.create({})
 }
 
killedBy: POST /cards/:id/comments adds a comment to the card and returns 201
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/services/cardService.ts:37:50
   return prisma.comment.create({ data: { content, cardId, userId } })
 }
 
-export async function deleteCard(cardId: number) {
-  return prisma.card.delete({ where: { id: cardId } })
-}
+export async function deleteCard(cardId: number) {}
 
killedBy: DELETE /cards/:id deletes a card and returns ok
statusReason: Invalid `prisma.user.create()` invocation in
C:\Curso\gs-workshop-taskflow\.stryker-tmp\sandbox-aXFTbT\src\test\helpers.ts:13:22

  10 const name = overrides?.name ?? 'Test User'
  11 const password = overrides?.password ?? 'password123'
  12 const hashed = await bcrypt.hash(password, 10)
→ 13 return prisma.user.create(
Unique constraint failed on the fields: (`email`)
