[Survived] StringLiteral
src/index.ts:11:9
 app.use(express.json())
 
 app.use('/users',  usersRouter)
-app.use('/boards', boardsRouter)
+app.use("", boardsRouter)
 app.use('/boards', activityRouter)
 app.use('/cards',  cardsRouter)

[Survived] ConditionalExpression
src/index.ts:15:5
 app.use('/boards', activityRouter)
 app.use('/cards',  cardsRouter)
 
-if (process.env.NODE_ENV !== 'test') {
+if (false) {
   const PORT = process.env.PORT || 3001
   app.listen(PORT, () => console.log(`taskflow running on :${PORT}`))

[Survived] EqualityOperator
src/index.ts:15:5
 app.use('/boards', activityRouter)
 app.use('/cards',  cardsRouter)
 
-if (process.env.NODE_ENV !== 'test') {
+if (process.env.NODE_ENV === 'test') {
   const PORT = process.env.PORT || 3001
   app.listen(PORT, () => console.log(`taskflow running on :${PORT}`))

[NoCoverage] ConditionalExpression
src/index.ts:16:16
 app.use('/cards',  cardsRouter)
 
 if (process.env.NODE_ENV !== 'test') {
-  const PORT = process.env.PORT || 3001
+  const PORT = false
   app.listen(PORT, () => console.log(`taskflow running on :${PORT}`))
 }

[NoCoverage] ConditionalExpression
src/index.ts:16:16
 app.use('/cards',  cardsRouter)
 
 if (process.env.NODE_ENV !== 'test') {
-  const PORT = process.env.PORT || 3001
+  const PORT = true
   app.listen(PORT, () => console.log(`taskflow running on :${PORT}`))
 }

[NoCoverage] ArrowFunction
src/index.ts:17:20
 
 if (process.env.NODE_ENV !== 'test') {
   const PORT = process.env.PORT || 3001
-  app.listen(PORT, () => console.log(`taskflow running on :${PORT}`))
+  app.listen(PORT, () => undefined)
 }
 
