[Killed] ObjectLiteral
src/repositories/activityRepo.ts:4:54
 import prisma from '../db'
 
 export async function findActivityByBoard(boardId: number) {
-  const events = await prisma.activityEvent.findMany({
-    where: { boardId },
-    orderBy: { createdAt: 'desc' },
-    include: {
-      actor: { select: { name: true } },
-      card: { select: { title: true } },
-      fromList: { select: { name: true } },
-      toList: { select: { name: true } },
-    },
-  })
+  const events = await prisma.activityEvent.findMany({})
 
   return events.map(e => ({
killedBy: activityRepo findActivityByBoard calls prisma.activityEvent.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { boardId: 1 }, …(2) } ]

Received: 

  1st spy call:

  [
-   {

[Killed] ObjectLiteral
src/repositories/activityRepo.ts:7:14
   const events = await prisma.activityEvent.findMany({
     where: { boardId },
     orderBy: { createdAt: 'desc' },
-    include: {
-      actor: { select: { name: true } },
-      card: { select: { title: true } },
-      fromList: { select: { name: true } },
-      toList: { select: { name: true } },
-    },
+    include: {},
   })
 
killedBy: activityRepo findActivityByBoard calls prisma.activityEvent.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { boardId: 1 }, …(2) } ]

Received: 

  1st spy call:

@@ -1,29 +1,8 @@
  [

[Killed] BooleanLiteral
src/repositories/activityRepo.ts:8:32
     where: { boardId },
     orderBy: { createdAt: 'desc' },
     include: {
-      actor: { select: { name: true } },
+      actor: { select: { name: false } },
       card: { select: { title: true } },
       fromList: { select: { name: true } },
killedBy: activityRepo findActivityByBoard calls prisma.activityEvent.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { boardId: 1 }, …(2) } ]

Received: 

  1st spy call:

@@ -1,11 +1,11 @@
  [

[Killed] BooleanLiteral
src/repositories/activityRepo.ts:9:32
     orderBy: { createdAt: 'desc' },
     include: {
       actor: { select: { name: true } },
-      card: { select: { title: true } },
+      card: { select: { title: false } },
       fromList: { select: { name: true } },
       toList: { select: { name: true } },
killedBy: activityRepo findActivityByBoard calls prisma.activityEvent.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { boardId: 1 }, …(2) } ]

Received: 

  1st spy call:

@@ -6,11 +6,11 @@
            "name": true,

[Killed] ObjectLiteral
src/repositories/activityRepo.ts:9:23
     orderBy: { createdAt: 'desc' },
     include: {
       actor: { select: { name: true } },
-      card: { select: { title: true } },
+      card: { select: {} },
       fromList: { select: { name: true } },
       toList: { select: { name: true } },
killedBy: activityRepo findActivityByBoard calls prisma.activityEvent.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { boardId: 1 }, …(2) } ]

Received: 

  1st spy call:

@@ -5,13 +5,11 @@
          "select": {

[Killed] BooleanLiteral
src/repositories/activityRepo.ts:10:35
     include: {
       actor: { select: { name: true } },
       card: { select: { title: true } },
-      fromList: { select: { name: true } },
+      fromList: { select: { name: false } },
       toList: { select: { name: true } },
     },
killedBy: activityRepo findActivityByBoard calls prisma.activityEvent.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { boardId: 1 }, …(2) } ]

Received: 

  1st spy call:

@@ -11,11 +11,11 @@
            "title": true,

[Killed] BooleanLiteral
src/repositories/activityRepo.ts:11:33
       actor: { select: { name: true } },
       card: { select: { title: true } },
       fromList: { select: { name: true } },
-      toList: { select: { name: true } },
+      toList: { select: { name: false } },
     },
   })
killedBy: activityRepo findActivityByBoard calls prisma.activityEvent.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { boardId: 1 }, …(2) } ]

Received: 

  1st spy call:

@@ -16,11 +16,11 @@
            "name": true,

[Killed] ObjectLiteral
src/repositories/activityRepo.ts:11:25
       actor: { select: { name: true } },
       card: { select: { title: true } },
       fromList: { select: { name: true } },
-      toList: { select: { name: true } },
+      toList: { select: {} },
     },
   })
killedBy: activityRepo findActivityByBoard calls prisma.activityEvent.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { boardId: 1 }, …(2) } ]

Received: 

  1st spy call:

@@ -15,13 +15,11 @@
          "select": {

[Survived] ArrowFunction
src/repositories/activityRepo.ts:15:21
     },
   })
 
-  return events.map(e => ({
-    id: e.id,
-    boardId: e.boardId,
-    actorId: e.actorId,
-    eventType: e.eventType,
-    cardId: e.cardId,
-    fromListId: e.fromListId,
-    toListId: e.toListId,
-    createdAt: e.createdAt,
-    actorName: e.actor.name,
-    cardTitle: e.card?.title ?? null,
-    fromListName: e.fromList?.name ?? null,
-    toListName: e.toList?.name ?? null,
-  }))
+  return events.map(() => undefined)
 }
 

[NoCoverage] LogicalOperator
src/repositories/activityRepo.ts:25:16
     toListId: e.toListId,
     createdAt: e.createdAt,
     actorName: e.actor.name,
-    cardTitle: e.card?.title ?? null,
+    cardTitle: e.card?.title && null,
     fromListName: e.fromList?.name ?? null,
     toListName: e.toList?.name ?? null,

[NoCoverage] OptionalChaining
src/repositories/activityRepo.ts:25:16
     toListId: e.toListId,
     createdAt: e.createdAt,
     actorName: e.actor.name,
-    cardTitle: e.card?.title ?? null,
+    cardTitle: e.card.title ?? null,
     fromListName: e.fromList?.name ?? null,
     toListName: e.toList?.name ?? null,

[NoCoverage] LogicalOperator
src/repositories/activityRepo.ts:26:19
     createdAt: e.createdAt,
     actorName: e.actor.name,
     cardTitle: e.card?.title ?? null,
-    fromListName: e.fromList?.name ?? null,
+    fromListName: e.fromList?.name && null,
     toListName: e.toList?.name ?? null,
   }))

[NoCoverage] OptionalChaining
src/repositories/activityRepo.ts:26:19
     createdAt: e.createdAt,
     actorName: e.actor.name,
     cardTitle: e.card?.title ?? null,
-    fromListName: e.fromList?.name ?? null,
+    fromListName: e.fromList.name ?? null,
     toListName: e.toList?.name ?? null,
   }))

[NoCoverage] OptionalChaining
src/repositories/activityRepo.ts:27:17
     actorName: e.actor.name,
     cardTitle: e.card?.title ?? null,
     fromListName: e.fromList?.name ?? null,
-    toListName: e.toList?.name ?? null,
+    toListName: e.toList.name ?? null,
   }))
 }

[NoCoverage] LogicalOperator
src/repositories/activityRepo.ts:27:17
     actorName: e.actor.name,
     cardTitle: e.card?.title ?? null,
     fromListName: e.fromList?.name ?? null,
-    toListName: e.toList?.name ?? null,
+    toListName: e.toList?.name && null,
   }))
 }
