[Killed] BlockStatement
src/repositories/boardRepo.ts:3:71
 import prisma from '../db'
 
-export async function findMembership(userId: number, boardId: number) {
-  return prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
-  })
-}
+export async function findMembership(userId: number, boardId: number) {}
 
 export async function findBoardsByUser(userId: number) {
killedBy: boardRepo findMembership calls prisma.boardMember.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { …(1) } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/boardRepo.ts:5:30
 
 export async function findMembership(userId: number, boardId: number) {
   return prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
+    where: { userId_boardId: {} },
   })
 }
killedBy: boardRepo findMembership calls prisma.boardMember.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { …(1) } } ]

Received: 

  1st spy call:

  [
    {

[Killed] BlockStatement
src/repositories/boardRepo.ts:9:56
   })
 }
 
-export async function findBoardsByUser(userId: number) {
-  return prisma.board.findMany({
-    where: { members: { some: { userId } } },
-  })
-}
+export async function findBoardsByUser(userId: number) {}
 
 export async function findBoardById(id: number) {
killedBy: boardRepo findBoardsByUser calls prisma.board.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { members: { …(1) } } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/boardRepo.ts:11:31
 
 export async function findBoardsByUser(userId: number) {
   return prisma.board.findMany({
-    where: { members: { some: { userId } } },
+    where: { members: { some: {} } },
   })
 }
killedBy: boardRepo findBoardsByUser calls prisma.board.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { members: { …(1) } } } ]

Received: 

  1st spy call:

  [
    {

[Killed] ObjectLiteral
src/repositories/boardRepo.ts:11:12
 
 export async function findBoardsByUser(userId: number) {
   return prisma.board.findMany({
-    where: { members: { some: { userId } } },
+    where: {},
   })
 }
killedBy: boardRepo findBoardsByUser calls prisma.board.findMany
statusReason: expected "spy" to be called with arguments: [ { where: { members: { …(1) } } } ]

Received: 

  1st spy call:

  [
    {

[Killed] BlockStatement
src/repositories/boardRepo.ts:15:49
   })
 }
 
-export async function findBoardById(id: number) {
-  return prisma.board.findUnique({ where: { id } })
-}
+export async function findBoardById(id: number) {}
 
 export async function findBoardWithDetails(boardId: number) {
killedBy: boardRepo findBoardById calls prisma.board.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { id: 4 } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/boardRepo.ts:25:18
     include: {
       lists: {
         orderBy: { position: 'asc' },
-        include: {
-          cards: {
-            orderBy: { position: 'asc' },
-            include: {
-              comments: true,
-              labels: { include: { label: true } },
-            },
-          },
-        },
+        include: {},
       },
     },
killedBy: boardRepo findBoardWithDetails calls prisma.board.findUnique with include
statusReason: expected "spy" to be called with arguments: [ { where: { id: 5 }, …(1) } ]

Received: 

  1st spy call:

@@ -1,24 +1,10 @@
  [

[Killed] ObjectLiteral
src/repositories/boardRepo.ts:26:18
       lists: {
         orderBy: { position: 'asc' },
         include: {
-          cards: {
-            orderBy: { position: 'asc' },
-            include: {
-              comments: true,
-              labels: { include: { label: true } },
-            },
-          },
+          cards: {},
         },
       },
killedBy: boardRepo findBoardWithDetails calls prisma.board.findUnique with include
statusReason: expected "spy" to be called with arguments: [ { where: { id: 5 }, …(1) } ]

Received: 

  1st spy call:

@@ -1,23 +1,11 @@
  [

[Killed] StringLiteral
src/repositories/boardRepo.ts:27:34
         orderBy: { position: 'asc' },
         include: {
           cards: {
-            orderBy: { position: 'asc' },
+            orderBy: { position: "" },
             include: {
               comments: true,
killedBy: boardRepo findBoardWithDetails calls prisma.board.findUnique with include
statusReason: expected "spy" to be called with arguments: [ { where: { id: 5 }, …(1) } ]

Received: 

  1st spy call:

@@ -11,11 +11,11 @@
                    "label": true,

[Killed] ObjectLiteral
src/repositories/boardRepo.ts:28:22
         include: {
           cards: {
             orderBy: { position: 'asc' },
-            include: {
-              comments: true,
-              labels: { include: { label: true } },
-            },
+            include: {},
           },
         },
killedBy: boardRepo findBoardWithDetails calls prisma.board.findUnique with include
statusReason: expected "spy" to be called with arguments: [ { where: { id: 5 }, …(1) } ]

Received: 

  1st spy call:

@@ -2,18 +2,11 @@
    {

[Killed] ConditionalExpression
src/repositories/boardRepo.ts:38:7
     },
   })
 
-  if (!board) return null
+  if (false) return null
 
   return {
killedBy: boardRepo findBoardWithDetails calls prisma.board.findUnique with include
statusReason: Cannot read properties of undefined (reading 'lists')

[Killed] BooleanLiteral
src/repositories/boardRepo.ts:38:7
     },
   })
 
-  if (!board) return null
+  if (board) return null
 
   return {
killedBy: boardRepo findBoardWithDetails calls prisma.board.findUnique with include
statusReason: Cannot read properties of undefined (reading 'lists')

[NoCoverage] ArrowFunction
src/repositories/boardRepo.ts:42:28
 
   return {
     ...board,
-    lists: board.lists.map(list => ({
-      ...list,
-      cards: list.cards.map(card => ({
-        ...card,
-        labels: card.labels.map(cl => cl.label),
-      })),
-    })),
+    lists: board.lists.map(() => undefined),
   }
 }

[NoCoverage] ArrowFunction
src/repositories/boardRepo.ts:44:29
     ...board,
     lists: board.lists.map(list => ({
       ...list,
-      cards: list.cards.map(card => ({
-        ...card,
-        labels: card.labels.map(cl => cl.label),
-      })),
+      cards: list.cards.map(() => undefined),
     })),
   }

[NoCoverage] ArrowFunction
src/repositories/boardRepo.ts:46:33
       ...list,
       cards: list.cards.map(card => ({
         ...card,
-        labels: card.labels.map(cl => cl.label),
+        labels: card.labels.map(() => undefined),
       })),
     })),

[Killed] BlockStatement
src/repositories/boardRepo.ts:52:49
   }
 }
 
-export async function createBoard(name: string) {
-  return prisma.board.create({ data: { name } })
-}
+export async function createBoard(name: string) {}
 
 export async function addBoardMember(userId: number, boardId: number, role: string = 'member') {
killedBy: boardRepo createBoard calls prisma.board.create
statusReason: expected "spy" to be called with arguments: [ { data: { name: 'Test' } } ]

Number of calls: 0

[Killed] BlockStatement
src/repositories/boardRepo.ts:56:96
   return prisma.board.create({ data: { name } })
 }
 
-export async function addBoardMember(userId: number, boardId: number, role: string = 'member') {
-  return prisma.boardMember.create({ data: { userId, boardId, role } })
-}
+export async function addBoardMember(userId: number, boardId: number, role: string = 'member') {}
 
killedBy: boardRepo addBoardMember calls prisma.boardMember.create
statusReason: expected "spy" to be called with arguments: [ { data: { userId: 1, …(2) } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/boardRepo.ts:57:44
 }
 
 export async function addBoardMember(userId: number, boardId: number, role: string = 'member') {
-  return prisma.boardMember.create({ data: { userId, boardId, role } })
+  return prisma.boardMember.create({ data: {} })
 }
 
killedBy: boardRepo addBoardMember calls prisma.boardMember.create
statusReason: expected "spy" to be called with arguments: [ { data: { userId: 1, …(2) } } ]

Received: 

  1st spy call:

  [
    {
