[Killed] BlockStatement
src/repositories/cardRepo.ts:3:48
 import prisma from '../db'
 
-export async function findCardById(id: number) {
-  return prisma.card.findUnique({ where: { id } })
-}
+export async function findCardById(id: number) {}
 
 export async function findCardWithDetails(id: number) {
killedBy: cardRepo findCardById calls prisma.card.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { id: 1 } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/cardRepo.ts:4:42
 import prisma from '../db'
 
 export async function findCardById(id: number) {
-  return prisma.card.findUnique({ where: { id } })
+  return prisma.card.findUnique({ where: {} })
 }
 
killedBy: cardRepo findCardById calls prisma.card.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { id: 1 } } ]

Received: 

  1st spy call:

  [
    {

[Killed] BlockStatement
src/repositories/cardRepo.ts:7:55
   return prisma.card.findUnique({ where: { id } })
 }
 
-export async function findCardWithDetails(id: number) {
-  const card = await prisma.card.findUnique({
-    where: { id },
-    include: {
-      comments: true,
-      labels: { include: { label: true } },
-    },
-  })
-
-  if (!card) return null
-
-  return {
-    ...card,
-    labels: card.labels.map(cl => cl.label),
-  }
-}
+export async function findCardWithDetails(id: number) {}
 
 export async function createCard(data: { title: string; description?: string; listId: number; assigneeId?: number }) {
killedBy: cardRepo findCardWithDetails calls prisma.card.findUnique with include
statusReason: expected "spy" to be called with arguments: [ { where: { id: 2 }, …(1) } ]

Number of calls: 0

[Killed] BooleanLiteral
src/repositories/cardRepo.ts:16:7
     },
   })
 
-  if (!card) return null
+  if (card) return null
 
   return {
killedBy: cardRepo findCardWithDetails calls prisma.card.findUnique with include
statusReason: Cannot read properties of undefined (reading 'labels')

[Killed] ConditionalExpression
src/repositories/cardRepo.ts:16:7
     },
   })
 
-  if (!card) return null
+  if (false) return null
 
   return {
killedBy: cardRepo findCardWithDetails calls prisma.card.findUnique with include
statusReason: Cannot read properties of undefined (reading 'labels')

[NoCoverage] ObjectLiteral
src/repositories/cardRepo.ts:18:10
 
   if (!card) return null
 
-  return {
-    ...card,
-    labels: card.labels.map(cl => cl.label),
-  }
+  return {}
 }
 

[Killed] BlockStatement
src/repositories/cardRepo.ts:24:118
   }
 }
 
-export async function createCard(data: { title: string; description?: string; listId: number; assigneeId?: number }) {
-  const count = await prisma.card.count({ where: { listId: data.listId } })
-  return prisma.card.create({
-    data: {
-      title: data.title,
-      description: data.description,
-      listId: data.listId,
-      assigneeId: data.assigneeId,
-      position: count,
-    },
-  })
-}
+export async function createCard(data: { title: string; description?: string; listId: number; assigneeId?: number }) {}
 
 export async function findListById(id: number) {
killedBy: cardRepo createCard calls prisma.card.create with correct data
statusReason: expected "spy" to be called with arguments: [ { data: { title: 'T', …(4) } } ]

Number of calls: 0

[Survived] ObjectLiteral
src/repositories/cardRepo.ts:25:41
 }
 
 export async function createCard(data: { title: string; description?: string; listId: number; assigneeId?: number }) {
-  const count = await prisma.card.count({ where: { listId: data.listId } })
+  const count = await prisma.card.count({})
   return prisma.card.create({
     data: {

[Killed] BlockStatement
src/repositories/cardRepo.ts:37:48
   })
 }
 
-export async function findListById(id: number) {
-  return prisma.list.findUnique({ where: { id } })
-}
+export async function findListById(id: number) {}
 
 export async function moveCardWithActivity(
killedBy: cardRepo findListById calls prisma.list.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { id: 5 } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/cardRepo.ts:38:42
 }
 
 export async function findListById(id: number) {
-  return prisma.list.findUnique({ where: { id } })
+  return prisma.list.findUnique({ where: {} })
 }
 
killedBy: cardRepo findListById calls prisma.list.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { id: 5 } } ]

Received: 

  1st spy call:

  [
    {

[Killed] BlockStatement
src/repositories/cardRepo.ts:48:3
   actorId: number,
   fromListId: number,
   boardId: number,
-) {
-  return prisma.$transaction(async (tx) => {
-    const card = await tx.card.update({
-      where: { id: cardId },
-      data: { listId: targetListId, position },
-    })
-
-    const event = await tx.activityEvent.create({
-      data: {
-        boardId,
-        actorId,
-        eventType: 'card_moved',
-        cardId,
-        fromListId,
-        toListId: targetListId,
-      },
-    })
-
-    return { card, event }
-  })
-}
+) {}
 
 export async function deleteCard(id: number) {
killedBy: cardRepo moveCardWithActivity calls $transaction and updates card and event
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/repositories/cardRepo.ts:49:44
   fromListId: number,
   boardId: number,
 ) {
-  return prisma.$transaction(async (tx) => {
-    const card = await tx.card.update({
-      where: { id: cardId },
-      data: { listId: targetListId, position },
-    })
-
-    const event = await tx.activityEvent.create({
-      data: {
-        boardId,
-        actorId,
-        eventType: 'card_moved',
-        cardId,
-        fromListId,
-        toListId: targetListId,
-      },
-    })
-
-    return { card, event }
-  })
+  return prisma.$transaction(async (tx) => {})
 }
 
killedBy: cardRepo moveCardWithActivity calls $transaction and updates card and event
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/cardRepo.ts:50:39
   boardId: number,
 ) {
   return prisma.$transaction(async (tx) => {
-    const card = await tx.card.update({
-      where: { id: cardId },
-      data: { listId: targetListId, position },
-    })
+    const card = await tx.card.update({})
 
     const event = await tx.activityEvent.create({
killedBy: cardRepo moveCardWithActivity calls $transaction and updates card and event
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   {

[Killed] ObjectLiteral
src/repositories/cardRepo.ts:51:14
 ) {
   return prisma.$transaction(async (tx) => {
     const card = await tx.card.update({
-      where: { id: cardId },
+      where: {},
       data: { listId: targetListId, position },
     })
killedBy: cardRepo moveCardWithActivity calls $transaction and updates card and event
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

@@ -2,10 +2,8 @@
    {

[Killed] ObjectLiteral
src/repositories/cardRepo.ts:52:13
   return prisma.$transaction(async (tx) => {
     const card = await tx.card.update({
       where: { id: cardId },
-      data: { listId: targetListId, position },
+      data: {},
     })
 
killedBy: cardRepo moveCardWithActivity calls $transaction and updates card and event
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
    {

[Killed] ObjectLiteral
src/repositories/cardRepo.ts:55:49
       data: { listId: targetListId, position },
     })
 
-    const event = await tx.activityEvent.create({
-      data: {
-        boardId,
-        actorId,
-        eventType: 'card_moved',
-        cardId,
-        fromListId,
-        toListId: targetListId,
-      },
-    })
+    const event = await tx.activityEvent.create({})
 
     return { card, event }
killedBy: cardRepo moveCardWithActivity calls $transaction and updates card and event
statusReason: expected "spy" to be called with arguments: [ { data: { boardId: 5, …(5) } } ]

Received: 

  1st spy call:

  [
-   {

[Survived] ObjectLiteral
src/repositories/cardRepo.ts:66:12
       },
     })
 
-    return { card, event }
+    return {}
   })
 }

[Killed] BlockStatement
src/repositories/cardRepo.ts:70:46
   })
 }
 
-export async function deleteCard(id: number) {
-  return prisma.card.delete({ where: { id } })
-}
+export async function deleteCard(id: number) {}
 
 export async function createComment(data: { content: string; cardId: number; userId: number }) {
killedBy: cardRepo deleteCard calls prisma.card.delete
statusReason: expected "spy" to be called with arguments: [ { where: { id: 7 } } ]

Number of calls: 0

[Killed] BlockStatement
src/repositories/cardRepo.ts:74:96
   return prisma.card.delete({ where: { id } })
 }
 
-export async function createComment(data: { content: string; cardId: number; userId: number }) {
-  return prisma.comment.create({ data })
-}
+export async function createComment(data: { content: string; cardId: number; userId: number }) {}
 
killedBy: cardRepo createComment calls prisma.comment.create
statusReason: expected "spy" to be called with arguments: [ { data: { content: 'c', …(2) } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/cardRepo.ts:75:32
 }
 
 export async function createComment(data: { content: string; cardId: number; userId: number }) {
-  return prisma.comment.create({ data })
+  return prisma.comment.create({})
 }
 
killedBy: cardRepo createComment calls prisma.comment.create
statusReason: expected "spy" to be called with arguments: [ { data: { content: 'c', …(2) } } ]

Received: 

  1st spy call:

  [
-   {
