[Killed] BlockStatement
src/routes/activity.ts:9:68
 const router = Router()
 
 // GET /boards/:id/activity — authenticated
-router.get('/:id/activity', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const boardId = parseInt(req.params.id)
-  const membership = await findMembership(userId, boardId)
-  if (!membership) {
-    res.status(403).json({ error: 'Not a board member' })
-    return
-  }
-
-  const events = await findActivityByBoard(boardId)
-  res.json(events)
-})
+router.get('/:id/activity', async (req: Request, res: Response) => {})
 
 // GET /boards/:id/activity/preview — no auth required
killedBy: Activity Feed GET /boards/:id/activity returns 401 for unauthenticated requests
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/routes/activity.ts:9:12
 const router = Router()
 
 // GET /boards/:id/activity — authenticated
-router.get('/:id/activity', async (req: Request, res: Response) => {
+router.get("", async (req: Request, res: Response) => {
   let userId: number
   try {
killedBy: Activity Feed GET /boards/:id/activity returns 401 for unauthenticated requests
statusReason: expected 404 to be 401 // Object.is equality

[Killed] BlockStatement
src/routes/activity.ts:11:7
 // GET /boards/:id/activity — authenticated
 router.get('/:id/activity', async (req: Request, res: Response) => {
   let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
+  try {} catch {
     res.status(401).json({ error: 'Unauthorized' })
     return
killedBy: Activity Feed GET /boards/:id/activity returns 401 for unauthenticated requests
statusReason: expected 403 to be 401 // Object.is equality

[Killed] BlockStatement
src/routes/activity.ts:13:11
   let userId: number
   try {
     userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
+  } catch {}
 
   const boardId = parseInt(req.params.id)
killedBy: Activity Feed GET /boards/:id/activity returns 401 for unauthenticated requests
statusReason: expected 403 to be 401 // Object.is equality

[Killed] BooleanLiteral
src/routes/activity.ts:20:7
 
   const boardId = parseInt(req.params.id)
   const membership = await findMembership(userId, boardId)
-  if (!membership) {
+  if (membership) {
     res.status(403).json({ error: 'Not a board member' })
     return
killedBy: Activity Feed GET /boards/:id/activity returns activity events for authenticated board members
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/routes/activity.ts:20:7
 
   const boardId = parseInt(req.params.id)
   const membership = await findMembership(userId, boardId)
-  if (!membership) {
+  if (true) {
     res.status(403).json({ error: 'Not a board member' })
     return
killedBy: Activity Feed GET /boards/:id/activity returns activity events for authenticated board members
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
src/routes/activity.ts:30:76
 })
 
 // GET /boards/:id/activity/preview — no auth required
-router.get('/:id/activity/preview', async (req: Request, res: Response) => {
-  const boardId = parseInt(req.params.id)
-  const events = await findActivityByBoard(boardId)
-  res.json(events)
-})
+router.get('/:id/activity/preview', async (req: Request, res: Response) => {})
 
 export default router
killedBy: Activity Feed GET /boards/:id/activity/preview returns events in reverse chronological order without authentication
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/routes/activity.ts:30:12
 })
 
 // GET /boards/:id/activity/preview — no auth required
-router.get('/:id/activity/preview', async (req: Request, res: Response) => {
+router.get("", async (req: Request, res: Response) => {
   const boardId = parseInt(req.params.id)
   const events = await findActivityByBoard(boardId)
killedBy: Activity Feed GET /boards/:id/activity/preview returns events in reverse chronological order without authentication
statusReason: expected 404 to be 200 // Object.is equality
