[NoCoverage] BlockStatement
src/routes/boards.ts:14:56
 const router = Router()
 
 // GET /boards — list boards for current user
-router.get('/', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const boards = await findBoardsByUser(userId)
-  res.json(boards)
-})
+router.get('/', async (req: Request, res: Response) => {})
 
 // GET /boards/:id — full board with lists, cards, comments

[NoCoverage] BlockStatement
src/routes/boards.ts:28:59
 })
 
 // GET /boards/:id — full board with lists, cards, comments
-router.get('/:id', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const boardId = parseInt(req.params.id)
-  const membership = await findMembership(userId, boardId)
-  if (!membership) {
-    res.status(403).json({ error: 'Not a board member' })
-    return
-  }
-
-  const board = await findBoardWithDetails(boardId)
-  if (!board) {
-    res.status(404).json({ error: 'Board not found' })
-    return
-  }
-
-  res.json(board)
-})
+router.get('/:id', async (req: Request, res: Response) => {})
 
 // POST /boards — create board

[NoCoverage] ObjectLiteral
src/routes/boards.ts:33:26
   try {
     userId = verifyToken(req)
   } catch {
-    res.status(401).json({ error: 'Unauthorized' })
+    res.status(401).json({})
     return
   }

[NoCoverage] ObjectLiteral
src/routes/boards.ts:40:26
   const boardId = parseInt(req.params.id)
   const membership = await findMembership(userId, boardId)
   if (!membership) {
-    res.status(403).json({ error: 'Not a board member' })
+    res.status(403).json({})
     return
   }

[NoCoverage] BooleanLiteral
src/routes/boards.ts:45:7
   }
 
   const board = await findBoardWithDetails(boardId)
-  if (!board) {
+  if (board) {
     res.status(404).json({ error: 'Board not found' })
     return

[NoCoverage] ConditionalExpression
src/routes/boards.ts:45:7
   }
 
   const board = await findBoardWithDetails(boardId)
-  if (!board) {
+  if (true) {
     res.status(404).json({ error: 'Board not found' })
     return

[NoCoverage] BlockStatement
src/routes/boards.ts:54:57
 })
 
 // POST /boards — create board
-router.post('/', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const { name } = req.body
-  const board = await createBoard(name)
-  await addBoardMember(userId, board.id, 'owner')
-  res.status(201).json(board)
-})
+router.post('/', async (req: Request, res: Response) => {})
 
 // POST /boards/:id/members — add member

[NoCoverage] BlockStatement
src/routes/boards.ts:70:68
 })
 
 // POST /boards/:id/members — add member
-router.post('/:id/members', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const boardId = parseInt(req.params.id)
-  const { memberId } = req.body
-  await addBoardMember(memberId, boardId)
-  res.status(201).json({ ok: true })
-})
+router.post('/:id/members', async (req: Request, res: Response) => {})
 
 export default router

[NoCoverage] StringLiteral
src/routes/boards.ts:75:35
   try {
     userId = verifyToken(req)
   } catch {
-    res.status(401).json({ error: 'Unauthorized' })
+    res.status(401).json({ error: "" })
     return
   }

[NoCoverage] BooleanLiteral
src/routes/boards.ts:82:30
   const boardId = parseInt(req.params.id)
   const { memberId } = req.body
   await addBoardMember(memberId, boardId)
-  res.status(201).json({ ok: true })
+  res.status(201).json({ ok: false })
 })
 
