[NoCoverage] BlockStatement
src/routes/cards.ts:16:59
 const router = Router()
 
 // GET /cards/:id
-router.get('/:id', async (req: Request, res: Response) => {
-  try {
-    verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const card = await findCardWithDetails(parseInt(req.params.id))
-  if (!card) {
-    res.status(404).json({ error: 'Not found' })
-    return
-  }
-  res.json(card)
-})
+router.get('/:id', async (req: Request, res: Response) => {})
 
 // POST /cards — create card

[NoCoverage] BlockStatement
src/routes/cards.ts:17:7
 
 // GET /cards/:id
 router.get('/:id', async (req: Request, res: Response) => {
-  try {
-    verifyToken(req)
-  } catch {
+  try {} catch {
     res.status(401).json({ error: 'Unauthorized' })
     return

[NoCoverage] BlockStatement
src/routes/cards.ts:19:11
 router.get('/:id', async (req: Request, res: Response) => {
   try {
     verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
+  } catch {}
 
   const card = await findCardWithDetails(parseInt(req.params.id))

[NoCoverage] ConditionalExpression
src/routes/cards.ts:25:7
   }
 
   const card = await findCardWithDetails(parseInt(req.params.id))
-  if (!card) {
+  if (false) {
     res.status(404).json({ error: 'Not found' })
     return

[NoCoverage] BlockStatement
src/routes/cards.ts:25:14
   }
 
   const card = await findCardWithDetails(parseInt(req.params.id))
-  if (!card) {
-    res.status(404).json({ error: 'Not found' })
-    return
-  }
+  if (!card) {}
   res.json(card)
 })

[NoCoverage] BlockStatement
src/routes/cards.ts:33:57
 })
 
 // POST /cards — create card
-router.post('/', async (req: Request, res: Response) => {
-  try {
-    verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const { title, description, listId, assigneeId } = req.body
-  const card = await createCard({ title, description, listId, assigneeId })
-  res.status(201).json(card)
-})
+router.post('/', async (req: Request, res: Response) => {})
 
 // PATCH /cards/:id/move — move card to different list

[Survived] StringLiteral
src/routes/cards.ts:33:13
 })
 
 // POST /cards — create card
-router.post('/', async (req: Request, res: Response) => {
+router.post("", async (req: Request, res: Response) => {
   try {
     verifyToken(req)

[NoCoverage] BlockStatement
src/routes/cards.ts:34:7
 
 // POST /cards — create card
 router.post('/', async (req: Request, res: Response) => {
-  try {
-    verifyToken(req)
-  } catch {
+  try {} catch {
     res.status(401).json({ error: 'Unauthorized' })
     return

[Killed] StringLiteral
src/routes/cards.ts:47:14
 })
 
 // PATCH /cards/:id/move — move card to different list
-router.patch('/:id/move', async (req: Request, res: Response) => {
+router.patch("", async (req: Request, res: Response) => {
   let userId: number
   try {
killedBy: Activity Feed PATCH /cards/:id/move creates an ActivityEvent in the same transaction
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/routes/cards.ts:60:7
   const { targetListId, position } = req.body
 
   const card = await findCardById(cardId)
-  if (!card) {
+  if (card) {
     res.status(404).json({ error: 'Card not found' })
     return
killedBy: Activity Feed PATCH /cards/:id/move creates an ActivityEvent in the same transaction
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/routes/cards.ts:60:7
   const { targetListId, position } = req.body
 
   const card = await findCardById(cardId)
-  if (!card) {
+  if (true) {
     res.status(404).json({ error: 'Card not found' })
     return
killedBy: Activity Feed PATCH /cards/:id/move creates an ActivityEvent in the same transaction
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/routes/cards.ts:66:7
   }
 
   const targetList = await findListById(targetListId)
-  if (!targetList) {
+  if (targetList) {
     res.status(404).json({ error: 'Target list not found' })
     return
killedBy: Activity Feed PATCH /cards/:id/move creates an ActivityEvent in the same transaction
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/routes/cards.ts:66:20
   }
 
   const targetList = await findListById(targetListId)
-  if (!targetList) {
-    res.status(404).json({ error: 'Target list not found' })
-    return
-  }
+  if (!targetList) {}
 
   const fromListId = card.listId
killedBy: Activity Feed PATCH /cards/:id/move returns 404 when moving a card to a non-existent list
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/routes/cards.ts:74:7
   const fromListId = card.listId
   const boardId = targetList.boardId
 
-  try {
-    const result = await moveCardWithActivity(cardId, targetListId, position, userId, fromListId, boardId)
-    res.json({ ok: true, event: result.event })
-  } catch (err: any) {
+  try {} catch (err: any) {
     res.status(500).json({ error: 'Move failed', details: err.message })
   }
killedBy: Activity Feed PATCH /cards/:id/move creates an ActivityEvent in the same transaction
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/routes/cards.ts:76:20
 
   try {
     const result = await moveCardWithActivity(cardId, targetListId, position, userId, fromListId, boardId)
-    res.json({ ok: true, event: result.event })
+    res.json({ ok: false, event: result.event })
   } catch (err: any) {
     res.status(500).json({ error: 'Move failed', details: err.message })
killedBy: Activity Feed PATCH /cards/:id/move creates an ActivityEvent in the same transaction
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/routes/cards.ts:77:22
   try {
     const result = await moveCardWithActivity(cardId, targetListId, position, userId, fromListId, boardId)
     res.json({ ok: true, event: result.event })
-  } catch (err: any) {
-    res.status(500).json({ error: 'Move failed', details: err.message })
-  }
+  } catch (err: any) {}
 })
 

[NoCoverage] StringLiteral
src/routes/cards.ts:78:35
     const result = await moveCardWithActivity(cardId, targetListId, position, userId, fromListId, boardId)
     res.json({ ok: true, event: result.event })
   } catch (err: any) {
-    res.status(500).json({ error: 'Move failed', details: err.message })
+    res.status(500).json({ error: "", details: err.message })
   }
 })

[NoCoverage] BlockStatement
src/routes/cards.ts:83:69
 })
 
 // POST /cards/:id/comments — add comment
-router.post('/:id/comments', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const { content } = req.body
-  const cardId = parseInt(req.params.id)
-  const comment = await createComment({ content, cardId, userId })
-  res.status(201).json(comment)
-})
+router.post('/:id/comments', async (req: Request, res: Response) => {})
 
 // DELETE /cards/:id

[Survived] StringLiteral
src/routes/cards.ts:83:13
 })
 
 // POST /cards/:id/comments — add comment
-router.post('/:id/comments', async (req: Request, res: Response) => {
+router.post("", async (req: Request, res: Response) => {
   let userId: number
   try {

[NoCoverage] BlockStatement
src/routes/cards.ts:99:62
 })
 
 // DELETE /cards/:id
-router.delete('/:id', async (req: Request, res: Response) => {
-  try {
-    verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const cardId = parseInt(req.params.id)
-  await deleteCard(cardId)
-  res.json({ ok: true })
-})
+router.delete('/:id', async (req: Request, res: Response) => {})
 
 export default router

[NoCoverage] BlockStatement
src/routes/cards.ts:100:7
 
 // DELETE /cards/:id
 router.delete('/:id', async (req: Request, res: Response) => {
-  try {
-    verifyToken(req)
-  } catch {
+  try {} catch {
     res.status(401).json({ error: 'Unauthorized' })
     return

[NoCoverage] BooleanLiteral
src/routes/cards.ts:109:18
 
   const cardId = parseInt(req.params.id)
   await deleteCard(cardId)
-  res.json({ ok: true })
+  res.json({ ok: false })
 })
 

[NoCoverage] ObjectLiteral
src/routes/cards.ts:109:12
 
   const cardId = parseInt(req.params.id)
   await deleteCard(cardId)
-  res.json({ ok: true })
+  res.json({})
 })
 
