[NoCoverage] BlockStatement
src/routes/users.ts:9:65
 const router = Router()
 
 // POST /users/register
-router.post('/register', async (req: Request, res: Response) => {
-  const { email, password, name } = req.body
-  const hashed = await bcrypt.hash(password, 10)
-  const user = await createUser({ email, password: hashed, name })
-  const { password: _, ...userWithoutPassword } = user
-  res.json(userWithoutPassword)
-})
+router.post('/register', async (req: Request, res: Response) => {})
 
 // POST /users/login

[NoCoverage] ObjectLiteral
src/routes/users.ts:12:33
 router.post('/register', async (req: Request, res: Response) => {
   const { email, password, name } = req.body
   const hashed = await bcrypt.hash(password, 10)
-  const user = await createUser({ email, password: hashed, name })
+  const user = await createUser({})
   const { password: _, ...userWithoutPassword } = user
   res.json(userWithoutPassword)

[NoCoverage] BlockStatement
src/routes/users.ts:18:62
 })
 
 // POST /users/login
-router.post('/login', async (req: Request, res: Response) => {
-  const { email, password } = req.body
-  const user = await findUserByEmail(email)
-  if (!user) {
-    res.status(401).json({ error: 'Invalid credentials' })
-    return
-  }
-  const valid = await bcrypt.compare(password, user.password)
-  if (!valid) {
-    res.status(401).json({ error: 'Invalid credentials' })
-    return
-  }
-  const token = signToken(user.id)
-  res.json({ token })
-})
+router.post('/login', async (req: Request, res: Response) => {})
 
 // GET /users/:id

[NoCoverage] ConditionalExpression
src/routes/users.ts:21:7
 router.post('/login', async (req: Request, res: Response) => {
   const { email, password } = req.body
   const user = await findUserByEmail(email)
-  if (!user) {
+  if (true) {
     res.status(401).json({ error: 'Invalid credentials' })
     return

[NoCoverage] ConditionalExpression
src/routes/users.ts:21:7
 router.post('/login', async (req: Request, res: Response) => {
   const { email, password } = req.body
   const user = await findUserByEmail(email)
-  if (!user) {
+  if (false) {
     res.status(401).json({ error: 'Invalid credentials' })
     return

[NoCoverage] StringLiteral
src/routes/users.ts:22:35
   const { email, password } = req.body
   const user = await findUserByEmail(email)
   if (!user) {
-    res.status(401).json({ error: 'Invalid credentials' })
+    res.status(401).json({ error: "" })
     return
   }

[NoCoverage] ConditionalExpression
src/routes/users.ts:26:7
     return
   }
   const valid = await bcrypt.compare(password, user.password)
-  if (!valid) {
+  if (false) {
     res.status(401).json({ error: 'Invalid credentials' })
     return

[NoCoverage] BlockStatement
src/routes/users.ts:26:15
     return
   }
   const valid = await bcrypt.compare(password, user.password)
-  if (!valid) {
-    res.status(401).json({ error: 'Invalid credentials' })
-    return
-  }
+  if (!valid) {}
   const token = signToken(user.id)
   res.json({ token })

[NoCoverage] StringLiteral
src/routes/users.ts:27:35
   }
   const valid = await bcrypt.compare(password, user.password)
   if (!valid) {
-    res.status(401).json({ error: 'Invalid credentials' })
+    res.status(401).json({ error: "" })
     return
   }

[NoCoverage] BlockStatement
src/routes/users.ts:35:59
 })
 
 // GET /users/:id
-router.get('/:id', async (req: Request, res: Response) => {
-  const user = await findUserById(parseInt(req.params.id))
-  if (!user) {
-    res.status(404).json({ error: 'Not found' })
-    return
-  }
-  const { password: _, ...userWithoutPassword } = user
-  res.json(userWithoutPassword)
-})
+router.get('/:id', async (req: Request, res: Response) => {})
 
 export default router

[Survived] StringLiteral
src/routes/users.ts:35:12
 })
 
 // GET /users/:id
-router.get('/:id', async (req: Request, res: Response) => {
+router.get("", async (req: Request, res: Response) => {
   const user = await findUserById(parseInt(req.params.id))
   if (!user) {

[NoCoverage] ConditionalExpression
src/routes/users.ts:37:7
 // GET /users/:id
 router.get('/:id', async (req: Request, res: Response) => {
   const user = await findUserById(parseInt(req.params.id))
-  if (!user) {
+  if (true) {
     res.status(404).json({ error: 'Not found' })
     return

[NoCoverage] BlockStatement
src/routes/users.ts:37:14
 // GET /users/:id
 router.get('/:id', async (req: Request, res: Response) => {
   const user = await findUserById(parseInt(req.params.id))
-  if (!user) {
-    res.status(404).json({ error: 'Not found' })
-    return
-  }
+  if (!user) {}
   const { password: _, ...userWithoutPassword } = user
   res.json(userWithoutPassword)
