[Killed] BlockStatement
src/repositories/userRepo.ts:3:91
 import prisma from '../db'
 
-export async function createUser(data: { email: string; password: string; name: string }) {
-  return prisma.user.create({ data })
-}
+export async function createUser(data: { email: string; password: string; name: string }) {}
 
 export async function findUserByEmail(email: string) {
killedBy: userRepo createUser calls prisma.user.create
statusReason: expected "spy" to be called with arguments: [ { data: { email: 'a', …(2) } } ]

Number of calls: 0

[Killed] BlockStatement
src/repositories/userRepo.ts:7:54
   return prisma.user.create({ data })
 }
 
-export async function findUserByEmail(email: string) {
-  return prisma.user.findUnique({ where: { email } })
-}
+export async function findUserByEmail(email: string) {}
 
 export async function findUserById(id: number) {
killedBy: userRepo findUserByEmail calls prisma.user.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { email: 'a@b.com' } } ]

Number of calls: 0

[Killed] BlockStatement
src/repositories/userRepo.ts:11:48
   return prisma.user.findUnique({ where: { email } })
 }
 
-export async function findUserById(id: number) {
-  return prisma.user.findUnique({ where: { id } })
-}
+export async function findUserById(id: number) {}
 
killedBy: userRepo findUserById calls prisma.user.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { id: 1 } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/userRepo.ts:12:42
 }
 
 export async function findUserById(id: number) {
-  return prisma.user.findUnique({ where: { id } })
+  return prisma.user.findUnique({ where: {} })
 }
 
killedBy: userRepo findUserById calls prisma.user.findUnique
statusReason: expected "spy" to be called with arguments: [ { where: { id: 1 } } ]

Received: 

  1st spy call:

  [
    {
