[Killed] BlockStatement
src/routes/activity.ts:14:72
   toList:   { select: { name: true } },
 } as const
 
-function formatEvents(events: Awaited<ReturnType<typeof fetchEvents>>) {
-  return events.map(e => ({
-    id:           e.id,
-    boardId:      e.boardId,
-    eventType:    e.eventType,
-    createdAt:    e.createdAt,
-    actorId:      e.actorId,
-    actorName:    e.actor.name,
-    cardId:       e.cardId,
-    cardTitle:    e.card?.title ?? null,
-    fromListId:   e.fromListId,
-    fromListName: e.fromList?.name ?? null,
-    toListId:     e.toListId,
-    toListName:   e.toList?.name ?? null,
-  }))
-}
+function formatEvents(events: Awaited<ReturnType<typeof fetchEvents>>) {}
 
 async function fetchEvents(boardId: number) {
killedBy: GET /boards/:id/activity returns shaped activity events to board members
statusReason: expected undefined to match object { actorName: 'Alice', …(3) }

[Killed] ArrowFunction
src/routes/activity.ts:15:21
 } as const
 
 function formatEvents(events: Awaited<ReturnType<typeof fetchEvents>>) {
-  return events.map(e => ({
-    id:           e.id,
-    boardId:      e.boardId,
-    eventType:    e.eventType,
-    createdAt:    e.createdAt,
-    actorId:      e.actorId,
-    actorName:    e.actor.name,
-    cardId:       e.cardId,
-    cardTitle:    e.card?.title ?? null,
-    fromListId:   e.fromListId,
-    fromListName: e.fromList?.name ?? null,
-    toListId:     e.toListId,
-    toListName:   e.toList?.name ?? null,
-  }))
+  return events.map(() => undefined)
 }
 
killedBy: GET /boards/:id/activity returns shaped activity events to board members
statusReason: expected null to match object { actorName: 'Alice', …(3) }

[Killed] ObjectLiteral
src/routes/activity.ts:15:27
 } as const
 
 function formatEvents(events: Awaited<ReturnType<typeof fetchEvents>>) {
-  return events.map(e => ({
-    id:           e.id,
-    boardId:      e.boardId,
-    eventType:    e.eventType,
-    createdAt:    e.createdAt,
-    actorId:      e.actorId,
-    actorName:    e.actor.name,
-    cardId:       e.cardId,
-    cardTitle:    e.card?.title ?? null,
-    fromListId:   e.fromListId,
-    fromListName: e.fromList?.name ?? null,
-    toListId:     e.toListId,
-    toListName:   e.toList?.name ?? null,
-  }))
+  return events.map(e => ({}))
 }
 
killedBy: GET /boards/:id/activity returns shaped activity events to board members
statusReason: expected {} to match object { actorName: 'Alice', …(3) }

[Killed] LogicalOperator
src/routes/activity.ts:23:19
     actorId:      e.actorId,
     actorName:    e.actor.name,
     cardId:       e.cardId,
-    cardTitle:    e.card?.title ?? null,
+    cardTitle:    e.card?.title && null,
     fromListId:   e.fromListId,
     fromListName: e.fromList?.name ?? null,
killedBy: GET /boards/:id/activity returns shaped activity events to board members
statusReason: expected { id: 1, boardId: 1, …(10) } to match object { actorName: 'Alice', …(3) }
(8 matching properties omitted from actual)

[Survived] OptionalChaining
src/routes/activity.ts:23:19
     actorId:      e.actorId,
     actorName:    e.actor.name,
     cardId:       e.cardId,
-    cardTitle:    e.card?.title ?? null,
+    cardTitle:    e.card.title ?? null,
     fromListId:   e.fromListId,
     fromListName: e.fromList?.name ?? null,

[Killed] LogicalOperator
src/routes/activity.ts:25:19
     cardId:       e.cardId,
     cardTitle:    e.card?.title ?? null,
     fromListId:   e.fromListId,
-    fromListName: e.fromList?.name ?? null,
+    fromListName: e.fromList?.name && null,
     toListId:     e.toListId,
     toListName:   e.toList?.name ?? null,
killedBy: GET /boards/:id/activity returns shaped activity events to board members
statusReason: expected { id: 1, boardId: 1, …(10) } to match object { actorName: 'Alice', …(3) }
(8 matching properties omitted from actual)

[Survived] OptionalChaining
src/routes/activity.ts:25:19
     cardId:       e.cardId,
     cardTitle:    e.card?.title ?? null,
     fromListId:   e.fromListId,
-    fromListName: e.fromList?.name ?? null,
+    fromListName: e.fromList.name ?? null,
     toListId:     e.toListId,
     toListName:   e.toList?.name ?? null,

[Killed] LogicalOperator
src/routes/activity.ts:27:19
     fromListId:   e.fromListId,
     fromListName: e.fromList?.name ?? null,
     toListId:     e.toListId,
-    toListName:   e.toList?.name ?? null,
+    toListName:   e.toList?.name && null,
   }))
 }
killedBy: GET /boards/:id/activity returns shaped activity events to board members
statusReason: expected { id: 1, boardId: 1, …(10) } to match object { actorName: 'Alice', …(3) }
(8 matching properties omitted from actual)

[Survived] OptionalChaining
src/routes/activity.ts:27:19
     fromListId:   e.fromListId,
     fromListName: e.fromList?.name ?? null,
     toListId:     e.toListId,
-    toListName:   e.toList?.name ?? null,
+    toListName:   e.toList.name ?? null,
   }))
 }

[Killed] BlockStatement
src/routes/activity.ts:31:45
   }))
 }
 
-async function fetchEvents(boardId: number) {
-  return prisma.activityEvent.findMany({
-    where:   { boardId },
-    orderBy: { createdAt: 'desc' },
-    include: activityInclude,
-  })
-}
+async function fetchEvents(boardId: number) {}
 
 // GET /boards/:id/activity — authenticated
killedBy: GET /boards/:id/activity returns shaped activity events to board members
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/routes/activity.ts:32:40
 }
 
 async function fetchEvents(boardId: number) {
-  return prisma.activityEvent.findMany({
-    where:   { boardId },
-    orderBy: { createdAt: 'desc' },
-    include: activityInclude,
-  })
+  return prisma.activityEvent.findMany({})
 }
 
killedBy: GET /boards/:id/activity/preview returns events newest-first without requiring authentication
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/routes/activity.ts:34:14
 async function fetchEvents(boardId: number) {
   return prisma.activityEvent.findMany({
     where:   { boardId },
-    orderBy: { createdAt: 'desc' },
+    orderBy: {},
     include: activityInclude,
   })
killedBy: GET /boards/:id/activity/preview returns events newest-first without requiring authentication
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/routes/activity.ts:40:68
 }
 
 // GET /boards/:id/activity — authenticated
-router.get('/:id/activity', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const boardId = parseInt(req.params.id)
-
-  // Query 1: membership check
-  const membership = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
-  })
-  if (!membership) {
-    res.status(403).json({ error: 'Not a board member' })
-    return
-  }
-
-  // Query 2: events with all relations via include
-  const events = await fetchEvents(boardId)
-  res.json(formatEvents(events))
-})
+router.get('/:id/activity', async (req: Request, res: Response) => {})
 
 // GET /boards/:id/activity/preview — no auth, for testing
killedBy: GET /boards/:id/activity returns 401 when no Authorization header is provided
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ObjectLiteral
src/routes/activity.ts:52:58
   const boardId = parseInt(req.params.id)
 
   // Query 1: membership check
-  const membership = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
-  })
+  const membership = await prisma.boardMember.findUnique({})
   if (!membership) {
     res.status(403).json({ error: 'Not a board member' })

[Killed] BlockStatement
src/routes/activity.ts:55:20
   const membership = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId } },
   })
-  if (!membership) {
-    res.status(403).json({ error: 'Not a board member' })
-    return
-  }
+  if (!membership) {}
 
   // Query 2: events with all relations via include
killedBy: GET /boards/:id/activity returns 403 when the caller is not a board member
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/routes/activity.ts:55:7
   const membership = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId } },
   })
-  if (!membership) {
+  if (membership) {
     res.status(403).json({ error: 'Not a board member' })
     return
killedBy: GET /boards/:id/activity returns 403 when the caller is not a board member
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/routes/activity.ts:66:76
 })
 
 // GET /boards/:id/activity/preview — no auth, for testing
-router.get('/:id/activity/preview', async (req: Request, res: Response) => {
-  const boardId = parseInt(req.params.id)
-
-  // Single query: events with all relations via include
-  const events = await fetchEvents(boardId)
-  res.json(formatEvents(events))
-})
+router.get('/:id/activity/preview', async (req: Request, res: Response) => {})
 
 export default router
killedBy: GET /boards/:id/activity/preview returns events newest-first without requiring authentication
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
