[Killed] BlockStatement
src/routes/boards.ts:7:79
 
 const router = Router()
 
-async function checkMember(userId: number, boardId: number): Promise<boolean> {
-  const m = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
-  })
-  return m !== null
-}
+async function checkMember(userId: number, boardId: number): Promise<boolean> {}
 
 async function checkOwner(userId: number, boardId: number): Promise<boolean> {
killedBy: GET /boards/:id returns 404 when the board does not exist
statusReason: expected 403 to be 404 // Object.is equality

[Killed] ObjectLiteral
src/routes/boards.ts:9:12
 
 async function checkMember(userId: number, boardId: number): Promise<boolean> {
   const m = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
+    where: {},
   })
   return m !== null
killedBy: GET /boards/:id — response body and query precision calls checkMember with the exact userId and boardId from the request
statusReason: expected "spy" to be called with arguments: [ { where: { …(1) } } ]

Received: 

  1st spy call:

  [
    {

[Killed] ConditionalExpression
src/routes/boards.ts:11:10
   const m = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId } },
   })
-  return m !== null
+  return true
 }
 
killedBy: GET /boards/:id returns 403 for users who are not board members
statusReason: expected 404 to be 403 // Object.is equality

[Killed] EqualityOperator
src/routes/boards.ts:11:10
   const m = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId } },
   })
-  return m !== null
+  return m === null
 }
 
killedBy: GET /boards/:id returns 403 for users who are not board members
statusReason: expected 404 to be 403 // Object.is equality

[Killed] BlockStatement
src/routes/boards.ts:14:78
   return m !== null
 }
 
-async function checkOwner(userId: number, boardId: number): Promise<boolean> {
-  const m = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
-  })
-  return m?.role === 'owner'
-}
+async function checkOwner(userId: number, boardId: number): Promise<boolean> {}
 
 // GET /boards — list boards for current user
killedBy: POST /boards/:id/members — response body and query precision checks ownership with the exact userId and boardId
statusReason: expected "spy" to be called with arguments: [ { where: { …(1) } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/routes/boards.ts:15:49
 }
 
 async function checkOwner(userId: number, boardId: number): Promise<boolean> {
-  const m = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
-  })
+  const m = await prisma.boardMember.findUnique({})
   return m?.role === 'owner'
 }
killedBy: POST /boards/:id/members — response body and query precision checks ownership with the exact userId and boardId
statusReason: expected "spy" to be called with arguments: [ { where: { …(1) } } ]

Received: 

  1st spy call:

  [
-   {

[Killed] ObjectLiteral
src/routes/boards.ts:16:30
 
 async function checkOwner(userId: number, boardId: number): Promise<boolean> {
   const m = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId } },
+    where: { userId_boardId: {} },
   })
   return m?.role === 'owner'
killedBy: POST /boards/:id/members — response body and query precision checks ownership with the exact userId and boardId
statusReason: expected "spy" to be called with arguments: [ { where: { …(1) } } ]

Received: 

  1st spy call:

  [
    {

[Killed] EqualityOperator
src/routes/boards.ts:18:10
   const m = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId } },
   })
-  return m?.role === 'owner'
+  return m?.role !== 'owner'
 }
 
killedBy: POST /boards/:id/members returns 403 and does not add the member when caller is a regular member
statusReason: expected 201 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/routes/boards.ts:18:10
   const m = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId } },
   })
-  return m?.role === 'owner'
+  return false
 }
 
killedBy: POST /boards/:id/members adds the member with role "member" when the caller is the owner
statusReason: expected 403 to be 201 // Object.is equality

[Killed] BlockStatement
src/routes/boards.ts:22:56
 }
 
 // GET /boards — list boards for current user
-router.get('/', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const memberships = await prisma.boardMember.findMany({
-    where: { userId },
-    include: { board: true },
-  })
-  res.json(memberships.map(m => m.board))
-})
+router.get('/', async (req: Request, res: Response) => {})
 
 // GET /boards/:id — full board with lists, cards, comments, labels
killedBy: GET /boards returns 401 without auth
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/routes/boards.ts:31:57
     return
   }
 
-  const memberships = await prisma.boardMember.findMany({
-    where: { userId },
-    include: { board: true },
-  })
+  const memberships = await prisma.boardMember.findMany({})
   res.json(memberships.map(m => m.board))
 })
killedBy: GET /boards loads boards in a single query with include — not a per-row loop
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/routes/boards.ts:33:14
 
   const memberships = await prisma.boardMember.findMany({
     where: { userId },
-    include: { board: true },
+    include: {},
   })
   res.json(memberships.map(m => m.board))
killedBy: GET /boards loads boards in a single query with include — not a per-row loop
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ArrowFunction
src/routes/boards.ts:35:28
     where: { userId },
     include: { board: true },
   })
-  res.json(memberships.map(m => m.board))
+  res.json(memberships.map(() => undefined))
 })
 
killedBy: GET /boards returns the boards the user belongs to
statusReason: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/routes/boards.ts:50:7
 
   const boardId = parseInt(req.params.id)
   const isMember = await checkMember(userId, boardId)
-  if (!isMember) {
+  if (true) {
     res.status(403).json({ error: 'Not a board member' })
     return
killedBy: GET /boards/:id returns 404 when the board does not exist
statusReason: expected 403 to be 404 // Object.is equality

[Killed] BooleanLiteral
src/routes/boards.ts:50:7
 
   const boardId = parseInt(req.params.id)
   const isMember = await checkMember(userId, boardId)
-  if (!isMember) {
+  if (isMember) {
     res.status(403).json({ error: 'Not a board member' })
     return
killedBy: GET /boards/:id returns 403 for users who are not board members
statusReason: expected 404 to be 403 // Object.is equality

[Killed] StringLiteral
src/routes/boards.ts:59:30
     where: { id: boardId },
     include: {
       lists: {
-        orderBy: { position: 'asc' },
+        orderBy: { position: "" },
         include: {
           cards: {
killedBy: GET /boards/:id — response body and query precision fetches the board by exact id with the full nested include structure
statusReason: expected "spy" to be called with arguments: [ { where: { id: 1 }, …(1) } ]

Received: 

  1st spy call:

@@ -16,11 +16,11 @@
                "position": "asc",

[Killed] BlockStatement
src/routes/boards.ts:72:15
       },
     },
   })
-  if (!board) {
-    res.status(404).json({ error: 'Board not found' })
-    return
-  }
+  if (!board) {}
 
   res.json(board)
killedBy: GET /boards/:id returns 404 when the board does not exist
statusReason: expected 200 to be 404 // Object.is equality

[Killed] ConditionalExpression
src/routes/boards.ts:72:7
       },
     },
   })
-  if (!board) {
+  if (false) {
     res.status(404).json({ error: 'Board not found' })
     return
killedBy: GET /boards/:id returns 404 when the board does not exist
statusReason: expected 200 to be 404 // Object.is equality

[Killed] StringLiteral
src/routes/boards.ts:73:35
     },
   })
   if (!board) {
-    res.status(404).json({ error: 'Board not found' })
+    res.status(404).json({ error: "" })
     return
   }
killedBy: GET /boards/:id returns 404 when the board does not exist
statusReason: expected { error: '' } to deeply equal { error: 'Board not found' }

[Timeout] BlockStatement
src/routes/boards.ts:81:57
 })
 
 // POST /boards — create board
-router.post('/', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const { name } = req.body
-  const board = await prisma.board.create({ data: { name } })
-  await prisma.boardMember.create({ data: { userId, boardId: board.id, role: 'owner' } })
-  res.status(201).json(board)
-})
+router.post('/', async (req: Request, res: Response) => {})
 
 // POST /boards/:id/members — add member (owner only)

[Killed] ObjectLiteral
src/routes/boards.ts:91:51
   }
 
   const { name } = req.body
-  const board = await prisma.board.create({ data: { name } })
+  const board = await prisma.board.create({ data: {} })
   await prisma.boardMember.create({ data: { userId, boardId: board.id, role: 'owner' } })
   res.status(201).json(board)
killedBy: POST /boards — response body and query precision passes the board name into board.create data
statusReason: expected "spy" to be called with arguments: [ { data: { name: 'Q2 Sprint' } } ]

Received: 

  1st spy call:

  [
    {

[Killed] BlockStatement
src/routes/boards.ts:97:68
 })
 
 // POST /boards/:id/members — add member (owner only)
-router.post('/:id/members', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const boardId = parseInt(req.params.id)
-  const isOwner = await checkOwner(userId, boardId)
-  if (!isOwner) {
-    res.status(403).json({ error: 'Only the board owner can add members' })
-    return
-  }
-
-  const { memberId } = req.body
-  await prisma.boardMember.create({ data: { userId: memberId, boardId, role: 'member' } })
-  res.status(201).json({ ok: true })
-})
+router.post('/:id/members', async (req: Request, res: Response) => {})
 
 export default router
killedBy: POST /boards/:id/members — response body and query precision returns { error: "Unauthorized" } as the body on 401
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/routes/boards.ts:97:13
 })
 
 // POST /boards/:id/members — add member (owner only)
-router.post('/:id/members', async (req: Request, res: Response) => {
+router.post("", async (req: Request, res: Response) => {
   let userId: number
   try {
killedBy: POST /boards/:id/members — response body and query precision returns { error: "Unauthorized" } as the body on 401
statusReason: expected {} to deeply equal { error: 'Unauthorized' }

[Killed] BooleanLiteral
src/routes/boards.ts:108:7
 
   const boardId = parseInt(req.params.id)
   const isOwner = await checkOwner(userId, boardId)
-  if (!isOwner) {
+  if (isOwner) {
     res.status(403).json({ error: 'Only the board owner can add members' })
     return
killedBy: POST /boards/:id/members returns 403 and does not add the member when caller is a regular member
statusReason: expected 201 to be 403 // Object.is equality

[Killed] BlockStatement
src/routes/boards.ts:108:17
 
   const boardId = parseInt(req.params.id)
   const isOwner = await checkOwner(userId, boardId)
-  if (!isOwner) {
-    res.status(403).json({ error: 'Only the board owner can add members' })
-    return
-  }
+  if (!isOwner) {}
 
   const { memberId } = req.body
killedBy: POST /boards/:id/members returns 403 and does not add the member when caller is a regular member
statusReason: expected 201 to be 403 // Object.is equality

[Killed] ObjectLiteral
src/routes/boards.ts:114:43
   }
 
   const { memberId } = req.body
-  await prisma.boardMember.create({ data: { userId: memberId, boardId, role: 'member' } })
+  await prisma.boardMember.create({ data: {} })
   res.status(201).json({ ok: true })
 })
killedBy: POST /boards/:id/members adds the member with role "member" when the caller is the owner
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/routes/boards.ts:115:30
 
   const { memberId } = req.body
   await prisma.boardMember.create({ data: { userId: memberId, boardId, role: 'member' } })
-  res.status(201).json({ ok: true })
+  res.status(201).json({ ok: false })
 })
 
killedBy: POST /boards/:id/members adds the member with role "member" when the caller is the owner
statusReason: expected { ok: false } to deeply equal { ok: true }
