[Killed] BlockStatement
src/routes/cards.ts:8:59
 const router = Router()
 
 // GET /cards/:id
-router.get('/:id', async (req: Request, res: Response) => {
-  try {
-    verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const card = await prisma.card.findUnique({
-    where: { id: parseInt(req.params.id) },
-    include: {
-      comments: true,
-      labels: { include: { label: true } },
-    },
-  })
-  if (!card) {
-    res.status(404).json({ error: 'Not found' })
-    return
-  }
-  res.json(card)
-})
+router.get('/:id', async (req: Request, res: Response) => {})
 
 // POST /cards — create card
killedBy: GET /cards/:id returns 401 without auth
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/routes/cards.ts:18:14
 
   const card = await prisma.card.findUnique({
     where: { id: parseInt(req.params.id) },
-    include: {
-      comments: true,
-      labels: { include: { label: true } },
-    },
+    include: {},
   })
   if (!card) {
killedBy: GET /cards/:id fetches card with labels and comments using include — no N+1
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/routes/cards.ts:20:15
     where: { id: parseInt(req.params.id) },
     include: {
       comments: true,
-      labels: { include: { label: true } },
+      labels: {},
     },
   })
killedBy: GET /cards/:id fetches card with labels and comments using include — no N+1
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/routes/cards.ts:23:7
       labels: { include: { label: true } },
     },
   })
-  if (!card) {
+  if (true) {
     res.status(404).json({ error: 'Not found' })
     return
killedBy: GET /cards/:id fetches card with labels and comments using include — no N+1
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/routes/cards.ts:23:7
       labels: { include: { label: true } },
     },
   })
-  if (!card) {
+  if (false) {
     res.status(404).json({ error: 'Not found' })
     return
killedBy: GET /cards/:id returns 404 when the card does not exist
statusReason: expected 200 to be 404 // Object.is equality

[Killed] BlockStatement
src/routes/cards.ts:31:57
 })
 
 // POST /cards — create card
-router.post('/', async (req: Request, res: Response) => {
-  try {
-    verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const { title, description, listId, assigneeId } = req.body
-  // Wrap count + create in a transaction to prevent position collisions under concurrency
-  const card = await prisma.$transaction(async (tx) => {
-    const count = await tx.card.count({ where: { listId } })
-    return tx.card.create({
-      data: { title, description, listId, assigneeId, position: count },
-    })
-  })
-  res.status(201).json(card)
-})
+router.post('/', async (req: Request, res: Response) => {})
 
 // PATCH /cards/:id/move — move card to different list
killedBy: POST /cards returns 401 without auth
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/routes/cards.ts:41:56
 
   const { title, description, listId, assigneeId } = req.body
   // Wrap count + create in a transaction to prevent position collisions under concurrency
-  const card = await prisma.$transaction(async (tx) => {
-    const count = await tx.card.count({ where: { listId } })
-    return tx.card.create({
-      data: { title, description, listId, assigneeId, position: count },
-    })
-  })
+  const card = await prisma.$transaction(async (tx) => {})
   res.status(201).json(card)
 })
killedBy: POST /cards sets position from a count query and wraps both in a transaction
statusReason: expected "spy" to be called with arguments: [ { where: { listId: 2 } } ]

Number of calls: 0

[Killed] ObjectLiteral
src/routes/cards.ts:42:48
   const { title, description, listId, assigneeId } = req.body
   // Wrap count + create in a transaction to prevent position collisions under concurrency
   const card = await prisma.$transaction(async (tx) => {
-    const count = await tx.card.count({ where: { listId } })
+    const count = await tx.card.count({ where: {} })
     return tx.card.create({
       data: { title, description, listId, assigneeId, position: count },
killedBy: POST /cards sets position from a count query and wraps both in a transaction
statusReason: expected "spy" to be called with arguments: [ { where: { listId: 2 } } ]

Received: 

  1st spy call:

  [
    {

[Killed] ObjectLiteral
src/routes/cards.ts:44:13
   const card = await prisma.$transaction(async (tx) => {
     const count = await tx.card.count({ where: { listId } })
     return tx.card.create({
-      data: { title, description, listId, assigneeId, position: count },
+      data: {},
     })
   })
killedBy: POST /cards sets position from a count query and wraps both in a transaction
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/routes/cards.ts:63:87
   const cardId = parseInt(req.params.id)
   const { targetListId, position } = req.body
 
-  const card = await prisma.card.findUnique({ where: { id: cardId }, include: { list: true } })
+  const card = await prisma.card.findUnique({ where: { id: cardId }, include: { list: false } })
   if (!card) {
     res.status(404).json({ error: 'Not found' })
killedBy: PATCH /cards/:id/move creates an ActivityEvent inside the same transaction as the card update
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/routes/cards.ts:63:79
   const cardId = parseInt(req.params.id)
   const { targetListId, position } = req.body
 
-  const card = await prisma.card.findUnique({ where: { id: cardId }, include: { list: true } })
+  const card = await prisma.card.findUnique({ where: { id: cardId }, include: {} })
   if (!card) {
     res.status(404).json({ error: 'Not found' })
killedBy: PATCH /cards/:id/move creates an ActivityEvent inside the same transaction as the card update
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/routes/cards.ts:64:7
   const { targetListId, position } = req.body
 
   const card = await prisma.card.findUnique({ where: { id: cardId }, include: { list: true } })
-  if (!card) {
+  if (false) {
     res.status(404).json({ error: 'Not found' })
     return
killedBy: PATCH /cards/:id/move creates an ActivityEvent inside the same transaction as the card update
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
src/routes/cards.ts:64:14
   const { targetListId, position } = req.body
 
   const card = await prisma.card.findUnique({ where: { id: cardId }, include: { list: true } })
-  if (!card) {
-    res.status(404).json({ error: 'Not found' })
-    return
-  }
+  if (!card) {}
 
   const fromListId = card.listId
killedBy: PATCH /cards/:id/move — database failure returns 404 when the card does not exist
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ObjectLiteral
src/routes/cards.ts:65:26
 
   const card = await prisma.card.findUnique({ where: { id: cardId }, include: { list: true } })
   if (!card) {
-    res.status(404).json({ error: 'Not found' })
+    res.status(404).json({})
     return
   }

[Killed] ConditionalExpression
src/routes/cards.ts:75:7
   const membership = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId } },
   })
-  if (!membership) {
+  if (false) {
     res.status(403).json({ error: 'Not a board member' })
     return
killedBy: PATCH /cards/:id/move returns 403 and does not execute the transaction when the caller is not a board member
statusReason: expected 500 to be 403 // Object.is equality

[Killed] BlockStatement
src/routes/cards.ts:80:7
     return
   }
 
-  try {
-    const [, event] = await prisma.$transaction([
-      prisma.card.update({ where: { id: cardId }, data: { listId: targetListId, position } }),
-      prisma.activityEvent.create({
-        data: {
-          eventType:  'card_moved',
-          cardId,
-          fromListId,
-          toListId:   targetListId,
-          actorId:    userId,
-          boardId,
-        },
-      }),
-    ])
-    res.json({ ok: true, event })
-  } catch (err) {
+  try {} catch (err) {
     const message = err instanceof Error ? err.message : String(err)
     res.status(500).json({ error: 'Move failed', details: message })
killedBy: PATCH /cards/:id/move moves the card and creates an ActivityEvent in a single transaction
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrayDeclaration
src/routes/cards.ts:81:49
   }
 
   try {
-    const [, event] = await prisma.$transaction([
-      prisma.card.update({ where: { id: cardId }, data: { listId: targetListId, position } }),
-      prisma.activityEvent.create({
-        data: {
-          eventType:  'card_moved',
-          cardId,
-          fromListId,
-          toListId:   targetListId,
-          actorId:    userId,
-          boardId,
-        },
-      }),
-    ])
+    const [, event] = await prisma.$transaction([])
     res.json({ ok: true, event })
   } catch (err) {
killedBy: PATCH /cards/:id/move creates an ActivityEvent inside the same transaction as the card update
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/routes/cards.ts:82:35
 
   try {
     const [, event] = await prisma.$transaction([
-      prisma.card.update({ where: { id: cardId }, data: { listId: targetListId, position } }),
+      prisma.card.update({ where: {}, data: { listId: targetListId, position } }),
       prisma.activityEvent.create({
         data: {
killedBy: PATCH /cards/:id/move creates an ActivityEvent inside the same transaction as the card update
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/routes/cards.ts:82:57
 
   try {
     const [, event] = await prisma.$transaction([
-      prisma.card.update({ where: { id: cardId }, data: { listId: targetListId, position } }),
+      prisma.card.update({ where: { id: cardId }, data: {} }),
       prisma.activityEvent.create({
         data: {
killedBy: PATCH /cards/:id/move creates an ActivityEvent inside the same transaction as the card update
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/routes/cards.ts:83:35
   try {
     const [, event] = await prisma.$transaction([
       prisma.card.update({ where: { id: cardId }, data: { listId: targetListId, position } }),
-      prisma.activityEvent.create({
-        data: {
-          eventType:  'card_moved',
-          cardId,
-          fromListId,
-          toListId:   targetListId,
-          actorId:    userId,
-          boardId,
-        },
-      }),
+      prisma.activityEvent.create({}),
     ])
     res.json({ ok: true, event })
killedBy: PATCH /cards/:id/move creates an ActivityEvent inside the same transaction as the card update
statusReason: expected 403 to be 200 // Object.is equality

[Killed] StringLiteral
src/routes/cards.ts:85:23
       prisma.card.update({ where: { id: cardId }, data: { listId: targetListId, position } }),
       prisma.activityEvent.create({
         data: {
-          eventType:  'card_moved',
+          eventType:  "",
           cardId,
           fromListId,
killedBy: PATCH /cards/:id/move moves the card and creates an ActivityEvent in a single transaction
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/routes/cards.ts:94:20
         },
       }),
     ])
-    res.json({ ok: true, event })
+    res.json({ ok: false, event })
   } catch (err) {
     const message = err instanceof Error ? err.message : String(err)
killedBy: PATCH /cards/:id/move creates an ActivityEvent inside the same transaction as the card update
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
src/routes/cards.ts:95:17
       }),
     ])
     res.json({ ok: true, event })
-  } catch (err) {
-    const message = err instanceof Error ? err.message : String(err)
-    res.status(500).json({ error: 'Move failed', details: message })
-  }
+  } catch (err) {}
 })
 
killedBy: PATCH /cards/:id/move returns 500 with details when the transaction fails
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/routes/cards.ts:102:69
 })
 
 // POST /cards/:id/comments — add comment
-router.post('/:id/comments', async (req: Request, res: Response) => {
-  let userId: number
-  try {
-    userId = verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const { content } = req.body
-  const cardId = parseInt(req.params.id)
-  const comment = await prisma.comment.create({ data: { content, cardId, userId } })
-  res.status(201).json(comment)
-})
+router.post('/:id/comments', async (req: Request, res: Response) => {})
 
 // DELETE /cards/:id
killedBy: POST /cards/:id/comments returns 401 without auth
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/routes/cards.ts:113:55
 
   const { content } = req.body
   const cardId = parseInt(req.params.id)
-  const comment = await prisma.comment.create({ data: { content, cardId, userId } })
+  const comment = await prisma.comment.create({ data: {} })
   res.status(201).json(comment)
 })
killedBy: POST /cards/:id/comments creates a comment linked to the card and the authenticated user
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/routes/cards.ts:113:47
 
   const { content } = req.body
   const cardId = parseInt(req.params.id)
-  const comment = await prisma.comment.create({ data: { content, cardId, userId } })
+  const comment = await prisma.comment.create({})
   res.status(201).json(comment)
 })
killedBy: POST /cards/:id/comments creates a comment linked to the card and the authenticated user
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/routes/cards.ts:130:22
   const cardId = parseInt(req.params.id)
   const card = await prisma.card.findUnique({
     where: { id: cardId },
-    include: { list: true },
+    include: { list: false },
   })
   if (!card) {
killedBy: DELETE /cards/:id — response body and query precision fetches the card by exact id with include: { list: true }
statusReason: expected "spy" to be called with arguments: [ { where: { id: 10 }, …(1) } ]

Received: 

  1st spy call:

@@ -1,9 +1,9 @@
  [

[Killed] BlockStatement
src/routes/cards.ts:132:14
     where: { id: cardId },
     include: { list: true },
   })
-  if (!card) {
-    res.status(404).json({ error: 'Not found' })
-    return
-  }
+  if (!card) {}
 
   const membership = await prisma.boardMember.findUnique({
killedBy: DELETE /cards/:id returns 404 when the card does not exist and does not call delete
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/routes/cards.ts:133:35
     include: { list: true },
   })
   if (!card) {
-    res.status(404).json({ error: 'Not found' })
+    res.status(404).json({ error: "" })
     return
   }
killedBy: DELETE /cards/:id — response body and query precision returns { error: "Not found" } as the body on 404
statusReason: expected { error: '' } to deeply equal { error: 'Not found' }

[Killed] ObjectLiteral
src/routes/cards.ts:137:58
     return
   }
 
-  const membership = await prisma.boardMember.findUnique({
-    where: { userId_boardId: { userId, boardId: card.list.boardId } },
-  })
+  const membership = await prisma.boardMember.findUnique({})
   if (!membership) {
     res.status(403).json({ error: 'Not a board member' })
killedBy: DELETE /cards/:id — response body and query precision checks board membership with exact userId and boardId
statusReason: expected "spy" to be called with arguments: [ { where: { …(1) } } ]

Received: 

  1st spy call:

  [
-   {

[Killed] ConditionalExpression
src/routes/cards.ts:140:7
   const membership = await prisma.boardMember.findUnique({
     where: { userId_boardId: { userId, boardId: card.list.boardId } },
   })
-  if (!membership) {
+  if (true) {
     res.status(403).json({ error: 'Not a board member' })
     return
killedBy: DELETE /cards/:id deletes the card when the caller is a board member
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/routes/cards.ts:146:18
   }
 
   await prisma.card.delete({ where: { id: cardId } })
-  res.json({ ok: true })
+  res.json({ ok: false })
 })
 
killedBy: DELETE /cards/:id deletes the card when the caller is a board member
statusReason: expected { ok: false } to deeply equal { ok: true }
