[Killed] BlockStatement
src/routes/users.ts:10:65
 const router = Router()
 
 // POST /users/register
-router.post('/register', async (req: Request, res: Response) => {
-  const { email, password, name } = req.body
-  const hashed = await bcrypt.hash(password, 10)
-  const { password: _pw, ...user } = await prisma.user.create({
-    data: { email, password: hashed, name },
-  })
-  res.json(user)
-})
+router.post('/register', async (req: Request, res: Response) => {})
 
 // POST /users/login
killedBy: POST /users/register returns the new user without the password field
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/routes/users.ts:10:13
 const router = Router()
 
 // POST /users/register
-router.post('/register', async (req: Request, res: Response) => {
+router.post("", async (req: Request, res: Response) => {
   const { email, password, name } = req.body
   const hashed = await bcrypt.hash(password, 10)
killedBy: POST /users/register returns the new user without the password field
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/routes/users.ts:14:11
   const { email, password, name } = req.body
   const hashed = await bcrypt.hash(password, 10)
   const { password: _pw, ...user } = await prisma.user.create({
-    data: { email, password: hashed, name },
+    data: {},
   })
   res.json(user)
killedBy: POST /users/register stores a bcrypt hash, not the plain-text password
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/routes/users.ts:20:62
 })
 
 // POST /users/login
-router.post('/login', async (req: Request, res: Response) => {
-  const { email, password } = req.body
-  const user = await prisma.user.findUnique({ where: { email } })
-  if (!user) {
-    res.status(401).json({ error: 'Invalid credentials' })
-    return
-  }
-  const valid = await bcrypt.compare(password, user.password)
-  if (!valid) {
-    res.status(401).json({ error: 'Invalid credentials' })
-    return
-  }
-  const token = jwt.sign({ userId: user.id }, JWT_SECRET, { expiresIn: '7d' })
-  res.json({ token })
-})
+router.post('/login', async (req: Request, res: Response) => {})
 
 // GET /users/:id
killedBy: POST /users/login returns a signed JWT for valid credentials
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/routes/users.ts:23:7
 router.post('/login', async (req: Request, res: Response) => {
   const { email, password } = req.body
   const user = await prisma.user.findUnique({ where: { email } })
-  if (!user) {
+  if (false) {
     res.status(401).json({ error: 'Invalid credentials' })
     return
killedBy: POST /users/login returns 401 when the user does not exist
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/routes/users.ts:23:7
 router.post('/login', async (req: Request, res: Response) => {
   const { email, password } = req.body
   const user = await prisma.user.findUnique({ where: { email } })
-  if (!user) {
+  if (true) {
     res.status(401).json({ error: 'Invalid credentials' })
     return
killedBy: POST /users/login returns a signed JWT for valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/routes/users.ts:24:26
   const { email, password } = req.body
   const user = await prisma.user.findUnique({ where: { email } })
   if (!user) {
-    res.status(401).json({ error: 'Invalid credentials' })
+    res.status(401).json({})
     return
   }
killedBy: POST /users/login returns 401 when the user does not exist
statusReason: expected {} to deeply equal { error: 'Invalid credentials' }

[Killed] BooleanLiteral
src/routes/users.ts:28:7
     return
   }
   const valid = await bcrypt.compare(password, user.password)
-  if (!valid) {
+  if (valid) {
     res.status(401).json({ error: 'Invalid credentials' })
     return
killedBy: POST /users/login returns a signed JWT for valid credentials
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BlockStatement
src/routes/users.ts:37:59
 })
 
 // GET /users/:id
-router.get('/:id', async (req: Request, res: Response) => {
-  try {
-    verifyToken(req)
-  } catch {
-    res.status(401).json({ error: 'Unauthorized' })
-    return
-  }
-
-  const user = await prisma.user.findUnique({ where: { id: parseInt(req.params.id) } })
-  if (!user) {
-    res.status(404).json({ error: 'Not found' })
-    return
-  }
-  const { password: _pw, ...safeUser } = user
-  res.json(safeUser)
-})
+router.get('/:id', async (req: Request, res: Response) => {})
 
 export default router
killedBy: GET /users/:id — response body and query precision returns { error: "Unauthorized" } as the body on 401
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/routes/users.ts:45:45
     return
   }
 
-  const user = await prisma.user.findUnique({ where: { id: parseInt(req.params.id) } })
+  const user = await prisma.user.findUnique({})
   if (!user) {
     res.status(404).json({ error: 'Not found' })
killedBy: GET /users/:id — response body and query precision looks up the user by exact id in the where clause
statusReason: expected "spy" to be called with arguments: [ { where: { id: 42 } } ]

Received: 

  1st spy call:

  [
-   {

[Killed] ObjectLiteral
src/routes/users.ts:45:54
     return
   }
 
-  const user = await prisma.user.findUnique({ where: { id: parseInt(req.params.id) } })
+  const user = await prisma.user.findUnique({ where: {} })
   if (!user) {
     res.status(404).json({ error: 'Not found' })
killedBy: GET /users/:id — response body and query precision looks up the user by exact id in the where clause
statusReason: expected "spy" to be called with arguments: [ { where: { id: 42 } } ]

Received: 

  1st spy call:

  [
    {

[Killed] ConditionalExpression
src/routes/users.ts:46:7
   }
 
   const user = await prisma.user.findUnique({ where: { id: parseInt(req.params.id) } })
-  if (!user) {
+  if (false) {
     res.status(404).json({ error: 'Not found' })
     return
killedBy: GET /users/:id returns 404 when the user does not exist
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/routes/users.ts:46:7
   }
 
   const user = await prisma.user.findUnique({ where: { id: parseInt(req.params.id) } })
-  if (!user) {
+  if (user) {
     res.status(404).json({ error: 'Not found' })
     return
killedBy: GET /users/:id returns the user without the password field
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/routes/users.ts:47:26
 
   const user = await prisma.user.findUnique({ where: { id: parseInt(req.params.id) } })
   if (!user) {
-    res.status(404).json({ error: 'Not found' })
+    res.status(404).json({})
     return
   }
killedBy: GET /users/:id returns 404 when the user does not exist
statusReason: expected {} to deeply equal { error: 'Not found' }
